{"id": "8963ec7ff63c8b8b67864bf3bf5d6f9ca57959f93353372bffde0d83ccbe656e", "url": "https://www.packers.com/news/dope-sheet-2025-season-review", "body": "PACKERS REACH THIRD STRAIGHT POSTSEASON The Green Bay Packers made the postseason for the third consecutive season. Green Bay was one of six NFL teams to make the playoffs in each of the last three seasons (2023-25), joining Buffalo, Houston, the Los Angeles Rams, Philadelphia and Pittsburgh. This is an abbreviated version of the Dope Sheet. Read the full version here (PDF). A LOOK BACK AT THE 2025 SCHEDULE The Green Bay Packers' 2025 NFL schedule featured eight home games and nine road contests and was highlighted by six primetime contests. Of the 17 games on the schedule, nine were against teams that made the playoffs in 2024, including four versus division champions. This is an abbreviated version of the Dope Sheet. Read the full version here (PDF). IN-SEASON AWARDS 2025 Season Review [PDF] This is the third time Green Bay and Chicago have met in the postseason It is the first time since 2021 that Green Bay will finish the regular season on the road Green Bay holds a 5-2 advantage in the series with wins in three of the last four The Green Bay Packers head to Chicago to take on the Bears in primetime It is only the second December visit to Denver in team history It is the latest first meeting between the Packers and Bears since 1998 It will be the 23rd meeting between the Packers and Lions on Thanksgiving This is the latest first meeting against Minnesota since 2012 It will be the third time the two teams have played in the last four yearsÂ It is the 33rd straight season that Green Bay will play on MNF Green Bay has won three consecutive games against Carolina COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "9b2e44a549592303598bc8c56135f80d162ce3604cf27f46c77b1fd1dd67fd36", "url": "https://www.packers.com/news/fans-reminded-of-project-play-60-set-for-feb-14-at-lambeau-field-2026", "body": "'Project Play 60' , the Green Bay Packers' event focused on getting kids out of the house to enjoy non-strenuous physical activity, is set for Saturday, Feb. 14. The free community event is open from 9 a.m. to 3 p.m. and will take place on the Lambeau Field Atrium's main floor and in the Legends Club on the fourth floor. The event will feature popular inflatables, interactive physical activity games, a ninja course, gymnastics circuit, climbing wall, face painting and more. Kids are also invited to join Emplify Health by Bellin certified instructors for 10-minute mindful yoga sessions to teach kids to use mindfulness and yoga techniques to strengthen their minds and bodies. For safety purposes, event participants are required to wear socks and athletic shoes. Waivers are required to be signed by parents/guardians prior to participating. Waivers can be signed in advance at packers.com/projectplay60 . Guests are invited to bring a hygiene item donation for the Help the Homeless Hygiene Drive. Community members are asked to donate hygiene items with the highest need, including laundry and dish soap, toilet paper and diapers sizes 3-6. Other items needed include shampoo, conditioner, body wash, shaving cream, deodorant, hand soap, garbage bags, disinfecting cleaners and kitchen trash bags. Parking will be free for guests participating in Project Play 60, and attendees should enter the Atrium through the American Family Insurance Gate on the east side of the stadium. Project Play 60 is a part of Green Bay Packers Give Back , the Packers' all-encompassing community outreach initiative, which includes the Green Bay Packers Foundation, appearances made by players, alumni, coaches and staff, youth football outreach, cash and in-kind donations, Make-A-Wish visits, and community events. Award funded through the NFL Foundation to honor law enforcement officers Grant to help lower registration fees or provide scholarships for players in need Food and beverage crawl to feature live entertainment, winter activities, photo ops and exciting prizes Whelan to connect with Packers fans and local sports communities as team continues to grow its presence in Ireland and the UK Free to the public, event will feature story time with Cameron Moreland, a reading by a Packers celebrity and a reading in Spanish New this year, applications now accepted from February to April 1; 2026 grants will go toward programs focusing on animal welfare, homelessness, human services Head Coach Matt LaFleur made the announcement Monday GM Brian Gutekunst, Head Coach Matt LaFleur and Executive VP/Director of Football Operations Russ Ball signed to multi-year contract extensions Presented by U.S. Venture, Titletown Winter Games will offer luge, curling, ski jumping, biathlon and figure skating Nixon earns first career selection, replaces Seattle Seahawks CB Devon Witherspoon Green Bay signs DL Jaden Crumedy, QB Kyle McCord to reserve/future contracts COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "89b3f888d4967f0105349c2ed3857ba473568d913e5fadee7a8a96e21c9bdfdd", "url": "https://www.packers.com/news/packers-accepting-nominations-for-packers-protect-serve-award-feb-13-2026", "body": "The Green Bay Packers are now accepting nominations for the \"Packers Protect & Serve Award,\" which recognizes exemplary law enforcement officers who go above and beyond the call of duty within the state of Wisconsin. Nominees should be active, full or part-time law enforcement officers who demonstrate leadership, dedication and a commitment to bettering their communities. Officers nominated should be those who have displayed heroism and/or exhibited extraordinary commitment to public safety, the community and their fellow officers. Nominators can submit an officer or department for one of four categories: Individual Officer Award, K-9 Award, School Resource Officer Award or Department Award. Fifteen awards will be presented: 12 Individual Officer Awards and one for each of the other three categories. The Packers Protect & Serve Award is funded by the Packers and the NFL Foundation, with each award recipient receiving a $2,000 grant to benefit his or her department or a nonprofit with which they are involved. Visit packers.formstack.com/forms/packers\\_protect\\_and\\_serve\\_award_2026 to nominate someone now through March 13. Further information can be obtained through the Packers' community outreach department at 920-569-7500. The Packers Protect & Serve Award is part of Green Bay Packers Give Back , the Packers' all-encompassing community outreach initiative. Combined with other Green Bay Packers charity endeavors, the awards contribute to a comprehensive Packers charity impact that was in excess of $13 million last year . Completed waivers required to participate; attendees invited to bring hygiene items to donate to the Help for the Homeless Hygiene Drive Grant to help lower registration fees or provide scholarships for players in need Food and beverage crawl to feature live entertainment, winter activities, photo ops and exciting prizes Whelan to connect with Packers fans and local sports communities as team continues to grow its presence in Ireland and the UK Free to the public, event will feature story time with Cameron Moreland, a reading by a Packers celebrity and a reading in Spanish New this year, applications now accepted from February to April 1; 2026 grants will go toward programs focusing on animal welfare, homelessness, human services Head Coach Matt LaFleur made the announcement Monday GM Brian Gutekunst, Head Coach Matt LaFleur and Executive VP/Director of Football Operations Russ Ball signed to multi-year contract extensions Presented by U.S. Venture, Titletown Winter Games will offer luge, curling, ski jumping, biathlon and figure skating Nixon earns first career selection, replaces Seattle Seahawks CB Devon Witherspoon Green Bay signs DL Jaden Crumedy, QB Kyle McCord to reserve/future contracts COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "f7e131006aa2daa6882d8d623b90381087e8a223461451d36800b2a8b36afb4d", "url": "https://www.packers.com/news/inbox-he-gave-it-a-shot-feb-13-2026", "body": "packers.com editor Doug from St. Germain, WI Make his mark? Good grief, Mike. Did you run that line past Evan Williams first? Just trying to keep this crowd on its toes. Marc from Holmen, WI Regarding Charlie from Waukesha's question about any other franchise that let two SB-winning quarterbacks walk, the New England Patriots share that distinction. Jim Plunkett won two with the Raiders and Tom Brady won one with Tampa Bay (albeit after a handful for the Patriots). Albeit indeed. Troy from Westminster, CO To answer Charlie from Waukesha, Tampa Bay let three Super Bowl-winning QBs walk out the door â Doug Williams, Steve Young and Trent Dilfer. Adding further insult to injury is all three were first-round picks by the Bucs. The Iowa Barnstormers let one Super Bowl-winning QB go. So there we have it. Gerry from Salina, KS I will soon be 82, and I have been a Packer fan since they drafted Paul Hornung. I got to know many Packers when teaching at St. Norbert when they still trained there. I also got to know Mike McCarthy when he was a student at Fort Hays State University in Kansas. I knew that Mike had potential, but I never dreamed that he would coach three of the historic teams in the NFL. I wish him well, but have the young coaches changed the game enough that he might struggle for wins? That's what everybody questioned when McCarthy left Green Bay. Then he took a year off, struggled through the pandemic season without his starting QB in Dallas, and won 12 games three straight years with the Cowboys. I have no idea how things will go in Pittsburgh, but McCarthy isn't oblivious to how the game has changed. Tim from Olathe, KS Mike, when they announced the signing of Micah Parsons last year it was like a jolt of electricity going through me like I have not felt since we traded for John Jefferson in the early '80s. JJ underwhelmed and it was demoralizing. Parsons got hurt and it was demoralizing. But the highs are worth risking the lows as a fan, no? That's like asking if as a fan you'd rather not make the playoffs at all than risk the heartbreak of getting in and getting bounced. That feels like an easy answer to me. Phil from Madison, WI Now that the season is over, any scuttlebutt on whether the tush push will be addressed again? It seems like it got less attention during the season, but I would hate to see it ignored, mostly because watching runners get carried along in a scrum fries my brain even more. Haven't heard anything yet, but with the owners' meetings at the end of March, issues to be addressed start to circulate a couple weeks in advance. Tallon from Castle Rock, CO Was hoping Jordan Love would win the Walter Payton award this year, but good for Wagner, it always goes to someone deserving. I totally see Love winning that award at some point, incredible guy with an amazing story that doesn't get enough attention. Who was the last Packer player to win? Since the inception of the NFL Man of the Year award in 1970 (it was named after Payton, who won it in '77, following his death in '99), a Packers player has never won it. In 2000, Green Bay-area native Jim Flanigan shared it with Tampa Bay linebacker Derrick Brooks when Flanigan played for the Bears, and then he played for the Packers the following year, in 2001. Steve from Eau Claire, WI Hey, Mike! I would like to know if you have a favorite NFL current player who is overlooked, and has a sneaky chance of becoming a HOFer? Thanks for all you guys do. GPG! I don't know about favorite or sneaky, but I'll mention two players I've admired from afar for their consistent, high level of play and impressive longevity, who may or may not retire this offseason, and whose Hall of Fame cases aren't slam dunks but will be very interesting to follow: Mike Evans and Harrison Smith. Dave from Germantown, TN Where did the Packers rank in penalties assessed in 2025? Can the penalties be counted for by down? Did the Packers have more third-down penalties? I don't have a by-down breakdown (say that five times fast). But I can tell you the Packers were called for 105 penalties in the regular season, which was 18th most in the league, so right near the middle. Five teams with more made the playoffs, eight teams with fewer did. Including offsetting and declined fouls, the Packers had 126, tied for 16th. Adrian from Chula Vista, CA II, I've been following the special teams discussions closely, and I have one question. Knowing that the ST coach is not going anywhere, injuries happen, we are not drafting ST-only players, and probably not picking up ST players in free agency, how do we go from what we had in 2025 to what Seattle had in 2025? GO PACK GO! The Packers need a dynamic returner who can impact field position, and the kicker needs to carry over his regular-season reliability to the postseason. William from Charleston, WV Good morning, II! While my questions about the dominance of Seattle's defense didn't garner much interest, it seems I may have been on to something unawares. They're now talking about \"tells\" from the Patriots' offensive line. Sounds like a scene out of \"Invincible.\" How often are \"tells\" part of the equation? Apparently, they made a big difference in this game. Anything to get an edge, and it can be easier to find one with extra time to prepare, like for a Super Bowl. I've never understood, though, why players would reveal publicly any pertinent info they (or their coaches) gleaned from film study on an opponent. Justin from Thousand Oaks, CA Not turning the ball over once the entire postseason isn't solely a QB stat, but it's one reason I feel like Sam Darnold deserves his flowers despite a statistically meager Super Bowl. Yes, he had the Seattle defense helping him out, but he also never gave the opposing (quite good) defenses a short field. New England was drowning and he never threw them a life preserver. I'm with you, but I was more impressed in this regard the previous game. Six of the 14 INTs Darnold threw in the regular season came against the Rams â four when the Seahawks lost by two points, and two in their OT win. Then he attempted 36 passes in the NFC title game against LA and wasn't picked off once. Justin from Thousand Oaks, CA Rumors abound that the Rams/49ers game in Melbourne will be played on Labor Day weekend. If true, is that likely just a function of the enormous time difference/travel slog or do you think they might be doing a test run for an 18-game season? A double-up from Justin because I missed this question earlier. For Week 1, the league abandoned Labor Day weekend 25 years ago, believing as the last bastion of summer it couldn't generate adequate ratings. It makes sense there'd be interest in re-testing that theory before an 18-game season would potentially return Week 1 to then. But also, yes, the travel time and time-zone difference with the Australia trip would almost necessitate a bye week before those teams' next games, so having them start their season a week early for the inaugural trip in this case would make sense as well. Steve from Ankeny, IA I find it interesting that Zach Tom commented after the season that he \"is considering surgery.\" He missed the last six games; wouldn't it make more sense to have the surgery while the season was going on to use those extra weeks to start healing. I assume there is more to that story. He thought there was a chance he could heal up well enough without surgery to play by season's end, so he gave it a shot. It didn't work out that way. The decision-making considerations change once the offseason arrives. Nothing more or less to it than that. Ray from Phoenix, AZ In your opinion, is Sean Rhyan on the Packers' 53 next year? If yes, is he at center or back to battle for the RG spot? If no, is it a lock that GB adds a FA center or draft a plug-in center with an early pick? If the Packers re-sign Rhyan, I think it'll be to start at center, and I'm not sure they'd want to use any of their Day 2 draft picks on that position. But I don't have any knowledge of what they're thinking. Joe from Bozeman, MT I agree with Mike that for every miss in the early rounds of the draft the Packers have had significant hits in the later rounds. The problem has been the first round, where no matter where you draft in that round you should get someone who can contribute right away and has a large upside. Lukas Van Ness has yet to show the potential the Packers sold us on and we hold our breaths to see what Morgan and Golden will bring in 2026. I expect all three of those players, health permitting, to play major roles on the 2026 Packers. What they do with their opportunities could have a seismic impact on the upcoming season and future. Jordan from Osterdock, IA I hope those comp pick projections hold because I have an odd excitement about drafting Mr. Irrelevant. We shall see. Mike from Geneva, IL The Packers have pick No. 199 in the draft. Back in 2000, the Patriots picked at 199 and changed the history of their organization. We don't need a QB but I'd be happy if the Packers can draft a player that can be considered the greatest ever at his position with pick 199 this year. Heck, I'd be happy if they can do that with any of their other picks. It can't be that hard, can it? Piece of corn. Can of cake. Joe from Dells, WI First the Arlington Heights Bears. Next the Indiana Bears. Now the Iowa Bears? What are your thoughts on the possibility of the Kenosha Bears? The amount of political posturing going on in this saga is reaching \"West Wing\" or \"House of Cards\" levels. Al from Green Bay, WI Spoff, curiosity question: We know players have contracts. Coaches, GMs and scouts also have contracts. But there are lots of other Packers employees including medical staff, field and equipment personnel, the all-important media department, and others. Are these typically at-will employees or do they have contracts as well? (If you and Wes have contracts, what can the II base do to get you two lucrative extensions?) None of the folks you mentioned in that list of employees, including me and Wes, has a contract. At least not that I know of. But I'm planning to serve as Wes's agent when I retire and he starts playing hardball. Jason from Buchanan, WI Since it's the offseason, can you give us some history on how this column came to be? What was Vic's impetus to start it all? For the uninitiated, Vic came to the Packers after a number of years with the Jaguars, where he'd started his \"Ask Vic\" column on their website, initially to answer fans' questions about the salary cap in the offseason. It grew from there to cover any and all topics for 10 years, and he brought the concept to us. After five full seasons he retired, turning the column over to me and Wes, and we renamed it Insider Inbox. Vic posted the first column on Feb. 21, 2011, so we are one week away from its 15th anniversary on packers.com. Graydon from Menomonie, WI Now that pitchers and catchers have reported, can we transition this to the Brewers Insider Inbox for a month or so? Sorry, I'm out next week and Wes will be at the controls. He'll probably talk UFC all week if you let him. Dan from Inver Grove Heights, MN Having crossed the Red Sea of the Super Bowl and now destined to spend months wandering the Sinai of hyperbolic umbrage, disingenuous dyspepsia and fictitious click-bait prestidigitation betwixt here and the draft, is there any balm in Gilead? Some actual, meaningful nugget to assuage this aging Packers fan? It seems only a minute ago, it was halftime and 21-3. Now it is the winter of my discontent. Whaddya got? Happy Friday? HAVE A QUESTION? Insider Inbox Join Packers.com writers as they answer the fans' questions in Insider Inbox If only it were that simple It's not a cure-all Happy for him and proud to know him Everyone wants to see how this Super Bowl story ends It's not too much for one offseason And the wheel in the NFL sky keeps on turning Maybe it's â¦ a little bit of all of the above The cap mandates the core philosophy A massive flaw was exposed Mike Holmgren should already be in Canton and he's not The Hall of Fame has thoroughly embarrassed itself COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "0d9785eb9c380c6ec7f693cd751f5cbbb2fa3599437b2c77f805a84c1be8c01d", "url": "https://www.packers.com/news/packers-award-20-wisconsin-youth-football-programs-with-financial-assistance-grant-feb-12-2026", "body": "The Green Bay Packers have announced they have awarded 20 Wisconsin youth football programs with a Youth Football Financial Assistance Grant. Funded through the USA Football NFL Club Foundation Grant, the Packers directed $25,000 to go toward financial assistance for youth football registration in Wisconsin. Programs who opted in were required to ensure all of their coaches were USA Football certified, with the Packers covering all certification fees, in order to be eligible for the grant. After reviewing eligibility information, 20 youth football programs in Wisconsin qualified to receive support through the grant, with each program receiving $1,250 to put toward registration financial assistance. Programs had the option to offer lower registration fees for each player, or provide individual registration scholarships up to $100 for players in need. The 20 programs that received grant funds were: This grant support is part of Green Bay Packers Give Back ,  the Packers' all-encompassing community outreach initiative. Packers Give Back includes the Packers Foundation's annual and impact grants, appearances by players, alumni, coaches and staff, cash and in-kind donations, community events, Make-A-Wish visits, football outreach and much more. These efforts contribute to a comprehensive Packers charity impact that was in excess of $13 million last year. Completed waivers required to participate; attendees invited to bring hygiene items to donate to the Help for the Homeless Hygiene Drive Award funded through the NFL Foundation to honor law enforcement officers Food and beverage crawl to feature live entertainment, winter activities, photo ops and exciting prizes Whelan to connect with Packers fans and local sports communities as team continues to grow its presence in Ireland and the UK Free to the public, event will feature story time with Cameron Moreland, a reading by a Packers celebrity and a reading in Spanish New this year, applications now accepted from February to April 1; 2026 grants will go toward programs focusing on animal welfare, homelessness, human services Head Coach Matt LaFleur made the announcement Monday GM Brian Gutekunst, Head Coach Matt LaFleur and Executive VP/Director of Football Operations Russ Ball signed to multi-year contract extensions Presented by U.S. Venture, Titletown Winter Games will offer luge, curling, ski jumping, biathlon and figure skating Nixon earns first career selection, replaces Seattle Seahawks CB Devon Witherspoon Green Bay signs DL Jaden Crumedy, QB Kyle McCord to reserve/future contracts COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "34d85afbe74f639f1945796d3399006644b1f30039241237f17a465f018e7059", "url": "https://www.packers.com/news/titletown-crawl-offering-food-drink-and-entertainment-on-march-7-2026", "body": "Community members are invited to taste their way through Titletown during the fourth annual Titletown Crawl presented by Circle K , on Saturday, March 7, from 1 to 6 p.m. Participating businesses include 46 Below CafÃ©/Leinenkugel's Beer Garden, Homefield Pub + Social, Hinterland Brewery, Lodge Kohler, BelAir Cantina, Packers Athletic Club/4th & Strong and Circle K. As event attendees make stops to enjoy a variety of food and refreshing beverages, they can take in live music from Fire on High from 1 to 3:15 p.m.  and Spicy Tie Band from 3:45 until 6 p.m.  adjacent to South Ridge Road. Other activities include painting the snow and ice at Ariens Hill and Hy-Vee Plaza, as well as other interactive games and photo opportunities. Please note that participants must wear rubber-soled shoes or snow boots in order to access the ice for painting, as well as sign a waiver. Waivers are available to be signed in advance at this link . Upon arrival, event attendees should check in at the Titletown Information Station â located outside Shopko Optical Playground â between 1 and 6 p.m., where they will receive their Titletown Crawl punch card. Upon making a purchase at each participating business, the corresponding hole will be punched. All participants who return completed punch cards to the Titletown information tent or any participating businesses before 6 p.m. will receive a prize. Additionally, completed punch cards will be entered for a chance to win one of several grand prizes. More information about this event, including a map of participating locations, can be found at titletown.com/events/titletown-crawl . Up-to-date information about activities can be found on Titletown's social media platforms, including Facebook , X and Instagram . Titletown includes TitletownTech, Homefield Pub + Social, Emplify Health by Bellin Titletown Sports Medicine and Orthopedics Clinic, Lodge Kohler, Hinterland Restaurant and Brewery, BelAir Cantina, Packers Athletic Club, Associated Bank and the U.S. Venture Center. For more info, visit titletown.com . Completed waivers required to participate; attendees invited to bring hygiene items to donate to the Help for the Homeless Hygiene Drive Award funded through the NFL Foundation to honor law enforcement officers Grant to help lower registration fees or provide scholarships for players in need Whelan to connect with Packers fans and local sports communities as team continues to grow its presence in Ireland and the UK Free to the public, event will feature story time with Cameron Moreland, a reading by a Packers celebrity and a reading in Spanish New this year, applications now accepted from February to April 1; 2026 grants will go toward programs focusing on animal welfare, homelessness, human services Head Coach Matt LaFleur made the announcement Monday GM Brian Gutekunst, Head Coach Matt LaFleur and Executive VP/Director of Football Operations Russ Ball signed to multi-year contract extensions Presented by U.S. Venture, Titletown Winter Games will offer luge, curling, ski jumping, biathlon and figure skating Nixon earns first career selection, replaces Seattle Seahawks CB Devon Witherspoon Green Bay signs DL Jaden Crumedy, QB Kyle McCord to reserve/future contracts COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "a37c2bfc1746a919c7e1df24ea47f9f9f72a5263cff1998ca3d5793b90c30a69", "url": "https://www.packers.com/news/dependable-jordy-nelson-possessed-exceptional-feel-for-the-game-feb-12-2026", "body": "Packers team historian Jordy Nelson Inducted: 2023 Wide Receiver: 2008-14, '16-17 Height: 6-3; Weight: 217 College: Kansas State, 2005-07 Honors: Years selected to an all-pro first team: 2014 Pro Bowl Selection (game played from 1950-2022): 2014 Even with some of the best of the best among NFL wide receivers, they honed a patented route that became their trademark. That didn't necessarily mean they were less than complete receivers, just that they excelled at a specific skill that forever stuck in the mind's eye of many of their contemporaries. In Jordy Nelson's case, it was the back-shoulder throw. Few receivers have ever executed the play any better. Nelson had the size at 6-foot-3, 217 pounds to tower over most cornerbacks, the discipline as a route runner to stay the course and leave room for the quarterback to fit the ball where it needed to be, and then the concentration and hands to make contested catches. \"He's got the best feel of any receiver I've ever played with and it's not really that close,\" Aaron Rodgers, the quarterback for almost all of Nelson's receptions, once said. The origin of the back-shoulder pass was as a red-zone play, but the Packers took it to another level during the Rodgers-Nelson years, using it anywhere on the field and off both short and long patterns. Beyond that, the play was all about timing and, arguably, there was never a passing combination that mastered that aspect of the play better than those two. \"(Nelson) probably had the best connection with Aaron out of that whole group,\" former coach Mike McCarthy said in reference to a deep and talented receiving corps that also included Greg Jennings, Donald Driver, James Jones and later Randall Cobb. The Packers selected Nelson with the fifth pick in the second round of the 2008 NFL Draft, and he turned out to be a steal in one of the leanest wide receiver crops in history. When no wide receiver was taken in the first round, there was a run on them in the second round with Nelson being the 36th overall pick and the third to go. Ten wide receivers were taken in all in that year's second round and half of them caught fewer than 50 passes in their NFL careers. Only DeSean Jackson caught more than Nelson, and Eddie Royal was the only other one to have more than four productive seasons. Nelson was certainly one of former general manager Ted Thompson's best draft picks and one that was also fully supported by the coaching staff, even if there were others across the league who questioned Nelson's upside, especially after he ran a 4.51 40-yard dash, tied for 25th among wide receivers at that year's scouting combine. But Nelson's film told a different story. It was highlighted by â but not limited to â his 10-catch, 137-yard performance against rival Kansas in his final college season, including a 68-yard touchdown, where he beat first-round cornerback prospect Aqib Talib. \"For me, this was one player where there wasn't one game (that jumped out),\" Lenny McGill, the Packers' Central Plains area scout at the time, said on draft day. \"Week in and week out, he was consistently making plays on a team that didn't really have a lot of weapons.\" That was never an issue in Green Bay. In Nelson's time with the Packers, there was no shortage of talent at the offensive skill positions. But the consistency tag never changed. \"Jordy Nelson isn't flashy â he's just dependable,\" Mike Ditka, former Super Bowl-winning coach and Pro Football Hall of Fame tight end, said in 2012 when he was working as an ESPN analyst. \"You win games with guys like that.\" Nelson made only six regular-season starts in his first three seasons, splitting time as the third and fourth receivers with Jones, who had a year's more experience. At that point, Nelson's biggest contribution might have been as a kickoff returner. Early on, as a receiver, his physical skills were better than advertised, and he was versatile enough to play in the slot. But he could be slowed at the line of scrimmage by bump-and-run coverage. Nelson's coming out party occurred in Super Bowl XLV, when a first-half injury to Driver increased his snaps and led to the most impressive stat line of any wide receiver on either team: nine catches for 140 yards, including the game's first touchdown on a 29-yard reception, and a 15.6 average overall as the Packers beat Pittsburgh, 31-25. In 2011, Nelson started nine games as the third receiver and led the Packers in receptions with 68 for 1,263 yards, an 18.6 average, and a team-high 15 touchdowns. In 2012, Nelson missed four games and most of two others with a hamstring injury; and in 2015, he spent the entire season on injured reserve after suffering a knee injury in the preseason. But in 2013, '14 and '16, Nelson was Rodgers' go-to receiver with some striking stats. His reception totals, in that order, for those three seasons, were: 85, 98 and 97. His average per catch lines read: 15.5, 15.5 and 13. His touchdown totals were eight, 13 and 14. He also won Associated Press Comeback Player of the Year honors in 2016. In 2017, Nelson finished third in receiving with 53 catches and a 9.1 average as Davante Adams supplanted him as the Packers' No. 1 receiver. Nelson was released following the season, and he played one more year with the Oakland Raiders. \"He's very athletic,\" Rodgers said when Nelson was at the height of his career. \"He can run all the routes needed outside. He's big-bodied and can go up and get the ball. But he's also agile enough and quick enough to be in the slot and make some plays there. So he has all the tools you want in a receiver.\" In nine years with the Packers, Nelson started 88 of 136 games. He caught 550 passes for 7,848 yards, an average of 14.3 per catch, with 69 touchdowns. In nine postseason games, he caught 54 passes, averaging 12.4 a reception, and scored five touchdowns. Born May 31, 1985, in Manhattan, Kan. Given name Jordy Ray Nelson. Second-round draft pick in 2006 brought big-play impact as go-to guy Defensive end recorded 37 sacks over three-year span Career rebirth in Green Bay sent him to Canton Franchise's chief executive for 17 years left his stamp on successful run Pass rusher known as \"KGB\" recorded double-digit sacks four straight years Trade by GM Ron Wolf brought franchise's eventual all-time leading rusher to Green Bay Seventh-round pick from UW's O-line factory became mainstay at RT Brett Favre's greatness remains indisputable Getting after the QB was his special calling Man-to-man coverage master took on opponents' top targets on his terms Technical master in pass protection overcame devastating injury, selected to two Pro Bowls COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "760c3d45c5824a24e8125442838803128775691e49551e0be177b4a2e697d2bf", "url": "https://www.packers.com/news/inbox-that-unit-hits-the-reset-button-feb-12-2026", "body": "packers.com editor Scott from Seattle, WA Greetings II and a giant welcoming to the baloney season. Let the fun begin. We weren't having fun before? Ed from Tucson, AZ I clearly remember Sam Darnold's \"seeing ghosts\" game against the Patriots and the resulting backlash. It felt like he might not ever overcome that. But six years later he beats the Patriots in the Super Bowl. Pretty poetic. I honestly had forgotten his opponent from that infamous MNF game until being reminded of it the other day. Charlie from Waukesha, WI First Brad Johnson, then Sam Darnold. Can you think of any other franchises that let two Super Bowl-winning QBs out the door? Now we're really getting harsh. David from Janesville, WI Mike, in the years the Packers had made it to the NFC Championship Game and lost, it really seemed like such a lost opportunity. Other years when they made the playoffs but made an early exit it felt like they maybe didn't have what it would take to win the Lombardi. This season was so odd because I have a similar level of disappointment as to when they were one game away. I think it's because they had it in them to be better, and we may not see a field of contenders as ripe for the taking again. I'm not sure where you're coming from there. I thought the NFC playoff field was loaded, and I said before the playoffs began I wouldn't be surprised if any team other than Carolina reached the Super Bowl. Given their injuries, had they not blown the game in Chicago the Packers would've had a massive challenge on their hands flying to Seattle to play the rested Seahawks. No matter how daunting, of course you want the opportunity, and that's what the Packers denied themselves. Even if they had won the first Chicago meltdown and taken the division to earn a home playoff game or two, any NFC playoff matchup at Lambeau would've been a true toss-up. The Packers definitely had it in them to be better, but this never felt like the lost opportunities of other heartbreaking playoff exits to me, due to the legitimate depth of the NFC contenders. Al from Green Bay, WI One play makes a difference. I'm thinking back to the Bills/Broncos game. If James Cook possesses the ball for a split second longer, it's a catch and not an interception. The Bills win that game, and are likely going to the Super Bowl, providing America with a much better matchup. Is that how you see it as well? First, it was Brandin Cooks, not James Cook. Second, it would've been no picnic for Buffalo to try to win the AFC title in Foxboro against a division rival, but I would've liked Josh Allen's chances. Referring to the topic above, the opportunity that got away from the Bills this year feels monstrous, with neither Patrick Mahomes, Joe Burrow, nor Lamar Jackson in Allen's way during the postseason. That may never happen again in his career. So it goes. Justin from Thousand Oaks, CA Lots of people mentioning how Seattle was happy to go for field goals and wondering whether a copycat league may follow suit next year, but we shouldn't forget how they made one of the gutsiest calls of the whole season: going for a walk-off two-point conversion against the Rams in Week 16. Likely ended up the difference between a wild card and home-field advantage. They had immense good fortune, like all SB winners, but they did a good job picking and choosing moments to be aggressive too. In the moment it felt incredibly gutsy, but with three minutes left in overtime and having lost to the Rams in their first meeting, a tie wasn't going to do the Seahawks much good, so it was really the only sensible decision to make. It turned out L.A. surprisingly was bumped the following week by the Falcons, but if both teams had finished 13-3-1, the Rams would've been division champs. Tommy from Washburn, WI I would assert that there is much more than an element of luck in the NFL. Compared to other professional sports, football has a shorter season, less games, and less plays and possession opportunities per game. This means that luck has a much more dramatic effect on the games, especially when you consider the elements in outdoor games, questionable officiating, field conditions and slipping, and plays like the Hail Mary. Even a blocked kick, I would say, has a large luck factor. No argument from me. H.R. from Henderson, NV \"Of any single player, he had the biggest impact on the game.\" Mike, I could not disagree with you more on this. Myers was the only player to score any points through three quarters, he had more points by himself than the entirety of the Patriots team, and he set two records (most FGs, most points by a kicker). There is absolutely no reason for him to have not won MVP other than every journalist admitting the award is only for offensive players. Shame on you for toeing that line. On the Seahawks' second FG drive, Walker accounted for all 55 yards gained. On the fourth FG drive, he accounted for 26 of 69 yards. On the last FG drive, he accounted for 27 of 30 yards. His work set up a lot of those kicks, and made them relatively short. As I said, if Myers had been banging through a bunch from 50-plus, we're having a different conversation. His longest kick was 41 yards, and four of the seven total were PAT distance or shorter. I give credit to the voters for awarding a running back for the first time since Terrell Davis. Andy from Kalamazoo, MI Dear Insiders, last year, the Packers put up 30 points on Seattle's D. Jordan Love wasn't sacked with a 123.8 rating. Eight starters on that Seattle D also started in the Super Bowl; Thomas played against GB and started against NE. Did the additions of Lawrence and Emmanwori make that much of a difference? How do you account for Seattle going from a roughly 11th-ranked D in '24, behind the Pack, to a nickname in one year? Is there a path for the Packers to improve that much next year? The Seahawks added a couple of key pieces, the players they had developed and improved, and the unit gelled in the second season with Macdonald's system. The group also stayed very healthy and played together every week. It was able to build toward a peak without a significant interruption. For the Packers, in Year 2 with Hafley, key guys got hurt, others saw their games level off or regress, depth at a premier position (corner) was suspect all season, and defenders dropped an inordinate number of catchable INTs. Now that unit hits the reset button on the coaching side, and some personnel will change, too. Thomas from Oviedo, FL The last two Super Bowls have proven one thing. The big games are won in the trenches. If you control the line of scrimmage you control the game. I am hoping the Packers load up on offensive and defensive linemen this offseason. If only it were that simple. The Seahawks controlled the trenches in the Super Bowl, certainly, but nobody has that type of edge all season, against every opponent. They also had solid QB play, two dynamic and productive running backs (until Charbonnet got hurt in the playoffs), the best and most dangerous young receiver in the game, four different defenders with at least six sacks, two with at least four picks, and a decided edge on special teams with a reliable kicker and explosive returner. Oh, and they made an entire three-game postseason run without turning the ball over once. Larry from Cumming, GA Based upon the latest Chicago loss and the current Super Bowl, it seems that exotic blitzes are becoming the norm. IMO the Packer offensive line didn't handle them very well in Chicago. Is this the starting point for building next year's offensive line? As far as how the unit is coached, how it communicates, and the protection calls and adjustments within the system, the struggles handling the Bears' defensive changeup in the playoff game will definitely be a part of how the Packers build their offensive line. Personnel-wise? No. Lee from Sullivan, IN Do teams get any financial kickback when they play overseas, specifically the home team? Do they get a percentage of ticket sales or something like that to help make up for the loss of revenue? The home team American city is just out of luck I guess. During the previous 16-game schedule, a team giving up a home game to play overseas was given a stipend by the league as compensation for the lost revenue. With the 17-game schedule, and teams losing their ninth home game to go overseas, I don't know if that's the case any longer. Richard from Caledonia, WI Good morning! Looking forward to the draft, can you provide the selection numbers the Packers will have in the upcoming draft by round? The Packers currently have one pick in each round from the second through the seventh. Those pick numbers are 52, 84, 120, 158, 199 and 236. They're also projected to get two compensatory seventh-rounders, which are estimated to be 254 and 257. Ray from Phoenix, AZ The feeling is Micah Parsons , Devonte Wyatt and Tucker Kraft will not be ready to start the year. Will their health status factor into the drafting for need rather that best player available? No, and while Parsons has talked realistically about playing roughly a month into the season, it's way too early in mid-February to have any idea on Wyatt or Kraft. James from Chicago, IL Ethan from CO, I've heard many fans say the same thing. What they fail to see is, the diehard is a valuable base to the NFL, but the NFL doesn't have to cater to them. Diehards watch games on TV, sellout stadiums, and buy the merch regardless of where the games are played, and they already get a full dose of their favorite team. The international games are not a punishment for diehards. They are a reward to those fans overseas fans who also have $$ to spend but no outlet in which to spend it. Bingo. The logic is similar to the broadcast contracts with streaming services, which also rankle some fans. The league isn't catering to them. It's trying to grow the audience by putting games on platforms non-diehards can find them. The small number of fans it may lose out of frustration or spite will pale in comparison to the number it stands to gain. It's a business calculation, plain and simple. Derek from South Point, OH Once the NFL season ends, I get fully geared up (pun intended) for racing. NASCAR officially starts this weekend, with Indycar, F1, and local tracks coming later. My brother, son, and I will be attending our first Indy 500 this year. What sports or specific sporting events fill the void for you until the next official kickoff? Next month I'll be all fired up for March Madness, and then baseball season starts shortly thereafter. Plenty of distraction for me. David from Janesville, WI Mike, I think losing Durbin hit me harder than losing Fastball Freddy, plus the Brewers empty the cupboard at third. Were you expecting Arnold to stockpile pitchers like this? Not exactly, but given his track record, I'm willing to give Arnold the benefit of the doubt. At least until he trades an All-Star closer at the deadline with the team in first place like his predecessor did. Scott from Lincoln City, OR Hey Mike, I experienced hypnopompia the other morning envisioning Rodgers coming back to the Packers to be Love's backup for his swan song year. No way that is happening, but does your gut tell you he'll be playing one final season for his former coach? Certainly seems like a distinct possibility. But what does falling into a trance during a graduation processional have to do with it? Sorry, I'll see myself out. Happy Thursday. HAVE A QUESTION? Insider Inbox Join Packers.com writers as they answer the fans' questions in Insider Inbox That feels like an easy answer It's not a cure-all Happy for him and proud to know him Everyone wants to see how this Super Bowl story ends It's not too much for one offseason And the wheel in the NFL sky keeps on turning Maybe it's â¦ a little bit of all of the above The cap mandates the core philosophy A massive flaw was exposed Mike Holmgren should already be in Canton and he's not The Hall of Fame has thoroughly embarrassed itself COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "11efbfa8f4c43d83389c8a3e5945182beeddaebf3564c7607079d14db1f0cf24", "url": "https://www.packers.com/news/inbox-there-s-always-an-element-of-luck-involved-feb-11-2026", "body": "packers.com editor Brad from Bozeman, MT I'm counting the Seahawks' victory as the Vikings' fifth Super Bowl loss. Alrighty then. Richard from Madison, WI Golly, an entire post-Super Bowl column that just talked about football and completely ignored the most exciting part of the entire evening, the halftime show (which is about the ONLY thing everyone else in the country had something to say about). Were you guys just off making pizza for all of that? I made pizzas before kickoff. I watched the halftime show and was impressed with the overall production, but I couldn't care less about all the blather. Not worth my time and energy. Mark from Bettendorf, IA Looking at that picture of John Schneider, I got thinking what his seasons have looked like with Seattle. I was astonished he has only one losing season since 2011, after two 7-9 seasons to start his tenure, and they made the playoffs one of those seasons. Truly amazing. Is his philosophy of building a team closer to Ted Thompson's or Gutey's? Neither, really. Schneider isn't afraid to roll the dice, and he's taken the kinds of chances rarely seen in the Thompson and Gutekunst eras until the Micah Parsons trade. But those risks have come with a cost. Various gambles left Seattle with just three draft picks in 2021, and that began a rough stretch of just one playoff appearance over four years (2021-24), and a one-and-done at that. Now the Seahawks have just four draft picks come April, but nobody's going to complain. It goes to show there isn't just one way of doing things, and there are different measures of success. Since beating the Packers in the game that shan't be discussed, the Seahawks didn't make it back to the NFC title game until winning it this year, while the Packers advanced to three (once by beating Seattle in the divisional round) but never got over the hump. The Seahawks snagged the ultimate prize, and it can never be taken away. But it also must be remembered â¦ Allan from Austin, TX Who would have thought a crazy two-point conversion could impact who goes to the Super Bowl? â¦ that if not for a goal-line pass that went backwards, bounced off a defender's helmet and caromed into the end zone, where a Seattle player casually picked it up completely unaware he was scoring two crucial points, the Seahawks don't get the NFC's No. 1 seed plus the bye and home field that went along with it. There's always an element of luck involved in winning it all. Always. John from Ashland, OR Hey Mike, what do you think the Packers can learn from how Seattle built and managed a Super Bowl-winning team? I don't know about learning anything. For me, it was a reminder of the defense Gutey tried to build with the big trade for Parsons â a pass rush that could win consistently without needing to blitz. The Packers didn't have the depth at corner the Seahawks did, but we'll see what this offseason brings there. Scotty from Lombard, IL One thing about this Sunday's game was the quality of the tackling. The Seahawks did not miss tackles, and the tackles were hard. While the Patriots had a lot of misses on Walker and Darnold. Tallon from Castle Rock, CO The Seahawks' punter was crazy. I was impressed by Daniel Whelan this year but their punter was so impressive I thought they should have given the MVP to the punter and the kicker! Would've been funny. Three of New England's drives started at the 2-, 4-, and 6-yard lines after Seattle punts, with a 47.3-yard net average on seven punts total. Dickson was on one. Jim from Hudsonville, MI I, too, believe this team is very close. However, the few holes we do have seem to be glaring. Our draft-and-develop process has served us well over the years, but do you think we approach this draft with a little less \"this player has a strong upside,\" and a little more \"this player can contribute immediately\"? Or does that question get answered more accurately after free agency? When draft-and-develop is the baseline, the process is always going to lean toward upside, because the players who develop into difference-makers, as opposed to the ones who just plug holes, ultimately decide games. For every miss on Josh Jackson in the second round and Jace Sternberger in the third round, there's finding Tucker Kraft in the third round and Zach Tom in the fourth round. That's the draft. Johnny from Madison, WI What was your favorite game and favorite memory from the 2025 season? Thanksgiving Day. David from Oak Hills, CA Now with the 2025 NFL season and the Super Bowl behind us, it's never too early too look forward to the new season. Next year the Seahawks open up vs. the following opponents: Cardinals, Rams, 49ers, Cowboys, Giants, Chiefs, Chargers, Patriots and Bears. Come Thursday, Sept. 10, 2026, who will the Seahawks play to kick off the 2026 season? The NFL season can't get here quick enough! Wow, several good choices there. A rematch of a dynamite NFC title game or lackluster Super Bowl in Week 1? We shall see. But I wonder if the league will pick the Bears, for the conference title game that almost was and the team that will inevitably have more hype surrounding it this offseason than any other. Darrel from Pueblo, CO II, with more games scheduled for overseas, do you ever see a time when the SB would be played overseas? I can't imagine it would but you never know. I wouldn't rule it out forever but don't see it as an imminent possibility. Tim from Champaign, IL I saw a wonderful little headline Friday. \"Woodson chooses liquor over ownership stake in the Browns.\" Given a choice between owning a piece of the Browns and a good stiff drink, which would you choose? (I think the choice is obvious.) Ha. Well, to be clear, Woodson actually chose to keep his name and likeness on his burgeoning wine and whiskey businesses, which wouldn't have been allowed had he been part of an ownership group of an NFL franchise. Classic Woodson savvy, always aware of where and how he can best make his mark. Tom from West Salem, WI I just read \"5 things\" with Gutekunst . He talked about bad win/loss record in December and January when you should be playing your best ball. The Packers' standard for the last 30 years has been a really good win/loss record in those months. I'm sure the last few years are an anomaly and that will change. It has to. Indeed it does. Even setting aside the last 30 years, the previous two have been nothing like LaFleur's first five during the stretch run. Peter from Eagan, MN I agree with GM Gutekunst that there has been improvement in the special teams with one glaring position that has not been addressed. That position is a punt and kick returner. Do the Packers need to dedicate a roster spot to a return specialist? It's not a cure-all, and it's worth remembering Seattle's Rashid Shaheed was playing a lot of receiver during the playoffs, too. I think the Packers just need more productive options for when injuries strike, because dedicating a roster spot to a return guy doesn't guarantee he'll stay healthy. Bart from Appleton, WI It was mentioned that Belichick being passed over for HOF would cause a problem for head coaches missing their chance, well another issue happened as it allowed a good player to enter. Roger Craig was a very good player, but I wouldn't consider him one of the best backs. Look at his numbers compared to others of the same time frame, kinda falls short. Granted it was veterans grouping, but Tiki Barber, Steven Jackson, Fred Taylor were better, just not fortunate to play on championship teams. Those backs didn't play in the same era as Craig, really, and the players they've been up against in the modern-era process have made it very difficult on them. I'm sure there's some truth to the championships bias, but it's not just about comparing career rushing totals. As noted yesterday, in his heyday Craig was a major offensive weapon as a receiver out of the backfield, which Taylor and Jackson (except for one year of boffo receiving production he never repeated) were not. There's a good argument to be made, though, that the last few years of Barber's career look a lot like Craig's best years. I just wonder if the fumble stats will be forever held against Tiki. Mike from Appleton, WI Regular reader here, thanks for the chat guys. When talking about Stafford's HOF worthiness, Mike mentioned his number of Pro Bowls and All-Pro selections. IMHO the number of Pro Bowls has become completely irrelevant due to the joke it has become. Am I wrong, does this still hold value? Cough...Shedeur Sanders....cough. I think it's still relevant for a player drafted back in 2009 like Stafford, but I agree it's become practically meaningless in recent years due to how deep into the alternate list the league regularly digs due to players who now skip the event because they just don't feel like attending. Dennis from Parrish, FL In Roger Craig's last high school game he rushed for 275 yards and four touchdowns. His Davenport Central squad lost 28-27 on the dreaded missed extra point. Why is this relevant to this forum? On the microphone for the Blue Devils was none other than Wayne Larrivee! Outstanding. Dave from Fairbanks, AK Not a question, but a comment on Jeff from Littlefork's question regarding cold games. I got to meet Tom Coughlin in Iraq in the early '00s, and asked him if he was as cold as his nose appeared to be. He (too quickly) denied being cold at all! I told him I was at the game, and despite my Alaskan \"cold-proof\" blood I was actually quite chilly and could own it! Somehow that seems totally on brand for Coughlin. Ethan from Fort Collins, CO I wish someone would acknowledge the large portion of the NFL fan base that is against the overseas games and their expansion. I hate the idea of the Packers losing a home game and I know many other fans of different teams feel the same. Why do I and other fans have to say goodbye to one of the exceedingly few home games every year just to deepen the pocketbooks of NFL execs? Because they run the game and the only control you have is how you spend your money and time. Tom from Fort Myers, FL For which of the Packers' regular-season games played on foreign soil were they the visiting team? It seems that teams like to keep the Packers on their home stadium schedule because they are a big draw and ensures their stadium is full even if it is filled with Packer fans. The Packers lost a home game when they went to London in 2022. They were the visiting team when they faced the Eagles in Brazil in 2024. Jay from Altoona, WI How does it work when a front office guy leaves such as Jon-Eric Sullivan? Surely the Packers wouldn't allow him to bring Packers scouting reports with him. Does he have his own private scouting reports he can take with him, or does he just use what Miami already has and supplement from memory? Mostly the latter. Scouts have steel-trap memories. But any reports he filed while working for the Packers are this team's, not Miami's. Todd from Campbell, CA When deciding which free agent to target/sign and/or resign your own player, do you base your offer on past performance or future potential? Or both? A player's market value is based on the contracts of comparable players on similar trajectories around the league. From that market-value estimate, teams decide whether they value the player that much and want to be involved in negotiations, or not. Darrin from Cataract, WI In response to the final comment in Tuesday's Inbox, Curt from Tampa, FL, must be a newbie. He obviously doesn't understand that Packers fans will stew and stew and stew on this season until well into next season. Packers fan for life, move on, enjoy your time on this planet. Brewers are right around the corner! Happy Wednesday. HAVE A QUESTION? Insider Inbox Join Packers.com writers as they answer the fans' questions in Insider Inbox That feels like an easy answer If only it were that simple Happy for him and proud to know him Everyone wants to see how this Super Bowl story ends It's not too much for one offseason And the wheel in the NFL sky keeps on turning Maybe it's â¦ a little bit of all of the above The cap mandates the core philosophy A massive flaw was exposed Mike Holmgren should already be in Canton and he's not The Hall of Fame has thoroughly embarrassed itself COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "adddfe7088fc275a122c1d47130dcb1bc0d617eb3cc2f37f8a53fe863a5b2ae8", "url": "https://www.packers.com/news/inbox-he-made-some-history-feb-10-2026", "body": "packers.com editor Alan from Mount Auburn, IL Boring. That's all I got. It was not a game for the ages, but it was played, and I'm back. Jeff from Hagerstown, MD Just so you know, it will be nice when you don't have these four days off next year. No complaints. Jodi from Grand Rapids, WI They are never getting rid of the Roman numerals, are they? The opportunity to make the switch for good was 10 years ago, when they went with the numeral \"50\" instead of the L. But alas. Markus from Aurora, CO The Seahawks' SB LX victory may get in their fans' heads, but I don't mind Sam Darnold getting a ring. But it better be the Packers next year ... I can't imagine how Vikings fans felt these last few weeks seeing Darnold accomplish what he did. Kerry from Lakewood Ranch, FL Biggest D-line vs O-line mismatch in the Super Bowl sinceâ¦? Last year? The Seahawks' four-man rush controlled the game, just as Philly's did against KC a year ago. When you can rush four and cover seven as dominantly as Seattle did, and then throw the opponent even more off-kilter with the occasional funky blitz call, the rest is academic. I didn't think it would be that lopsided, but it was a bad matchup in the trenches for the Patriots. Maye had been sacked 15 times in three postseason games prior to Sunday night. In hindsight, that didn't get enough attention. Tina from San Jose, CA Congrats to the Seachickens. Is John Schneider headed to the Pro Football HOF? He made some history. I read he's the first GM to win multiple Super Bowls with two different head coaches and none of the same players on the roster of the two title teams. That's something. Happy for him and proud to know him. Ron from Dubuque, IA Kenneth Walker was voted MVP with 135 yards rushing, 26 yards receiving, and no touchdowns. The Seahawks' defense was great without any one true star. Jason Myers, the Seahawks kicker, set two new records in the Super Bowl with 5-of-5 field goals and 17 total points. His first four field goals established a 12-0 lead and lots of momentum. I know that no kicker has won MVP in a Super Bowl, but do you think he received any consideration for MVP? Perhaps, and I suspect he would've gotten more if his kicks had been harder, but the longest of his five field goals was just 41 yards. Walker was a perfectly fine choice. Of any single player, he had the biggest impact on the game. Ken from New York, NY I think we're going to see more field goal attempts on fourth-and-short next season. I think that's perfectly fine. I'm curious myself, and I agree it would be fine. Mike from Geneva, IL Two things stood out to me during the Super Bowl. One, playing your best football when it matters most is critical. I don't think many teams could have beat the Seahawks with how their defense played. Two, drafting stars in the first round makes a difference. Look at Seattle's five first-rounders in the last four years and their contributions compared to Green Bay's first-round picks. Without first-round picks in the next two years, stars must be found elsewhere. No lies told. Matt from Fort Worth, TX What did you feel was the biggest surprise of the Super Bowl? Just how flustered and out of sorts Maye looked for three whole quarters. Al from Green Bay, WI Disappointing Super Bowl. With talking heads discussing the teams and matchup in advance of the game, there was one tidbit I heard that was shocking and probably unprecedented (assuming it's true). The tidbit: \"Eleven of the Patriots' wins during the regular season were against teams that will have a new head coach going into the upcoming season.\" Maybe it shouldn't have been surprising they couldn't compete with the top team from the NFC bracket. I got eight, not 11, when I counted them up myself, but the point still stands relative to their schedule, and I can't recall any recent playoff path with a more fortunate QB lineup (the playoff-winless Herbert, struggling Stroud, and injured Nix). Daniel from Chillicothe, MO This Super Bowl felt similar to last year's. One team with horrible offensive line play absolutely struggling against a great defensive front. Do you think NE would have been favored vs. any of the NFC playoff teams? I was thinking about that as the game unfolded, and my answer was maybe Carolina, but that's it. Caleb from Knoxville, TN What's your favorite non-Packers Super Bowl you've ever watched? I'll say the first one I have a specific memory of watching, Super Bowl XIV between the Steelers and Rams, the capper to Pittsburgh's dynasty of the '70s. Lynn Swann and John Stallworth were such exciting players. Nothing against Franco Harris, but the young me just getting into football wanted Terry Bradshaw to chuck it deep every play. Gary from Davenport, IA We were thrilled down here in Davenport that one of our high-school standouts from many years ago, Roger Craig, was finally going to be a member of the Pro Football Hall of Fame. His qualifications seemed impeccable, so why do you think it took the committee so long to recognize his accomplishments? I didn't follow how close (or not) Craig came to getting in during his modern-era process eligibility, but the door opened wider for him as a senior candidate with the recent honoring of players with shorter stretches of elite-level play (Terrell Davis, Kenny Easley, Tony Boselli, Sterling Sharpe). Craig played 11 years in the league, and his last four seasons were totally non-descript, but he had a five-year run (1985-89) as one of the dominant offensive forces in the game. He became the first player to record 1,000 rushing and receiving yards in the same season. He led the league in receptions that year. He led the league in yards from scrimmage three years later (his second of 2,000-plus), when he won Offensive Player of the Year. Recognition of shorter stretches of pre-eminent performance elevated Craig's status. Eric from Kenosha, WI OK, now Matt Stafford is a future Hall of Famer, with a Super Bowl and an MVP, right? He definitely shortened his wait. His lengthy body of work was plenty solid, but with only two Pro Bowl and no All-Pro selections before 2025, he just added a ton of sparkle to that CV. Damien from Australia Gutekunst at his press conference seemed more than a bit miffed by the five-game stretch the team lost to end the season. It's interesting that he's not letting injuries be part of the excuse though, I'd argue that the players that were lost were key cogs in the way LaFleur likes to operate, and the way the defense operated on the other side. I agree his profound disappointment at how the season ended came through loud and clear from that podium/table. But I understand his unwillingness to point to the injuries for the simple reason the Packers had the Bears beat, twice, and didn't close the deal. They built leads of 16-6 with five minutes to go and 27-16 with 6Â½ minutes left in two of the biggest games of the season without those injured players, so they should've been able to win those games. In his leadership position, it's the proper perspective. Mark from Ishpeming, MI Finishing the games and the season would be easier if the team had better conditioning. In six of the first seven games of the season they had at least two scores each game and averaged 15 points in the fourth quarter. In the last 11 games they never scored more than one TD in the fourth of any game averaging a little over four points. You could tell by the body language and being pushed around they weren't in shape. When do they address this problem? I disagree conditioning was a problem. In the late-season stretch you reference, against the Giants and Bears (first meeting), the Packers scored a go-ahead TD in the fourth quarter and closed out wins with INTs, and they put the Lions away on Thanksgiving with a clutch drive late. I don't think conditioning was the reason Romeo Doubs fumbled an onside kick, Malik Willis fumbled a fourth-down snap in OT, or the offense gained just one first down on four THIRD-quarter possessions in the playoffs. Patrick from Moreno Valley, CA With Jordan Love entering his prime and so many young core players already locked in, do you feel the Packers are positioned to be more aggressive in free agency over the next couple seasons, or is the long-term draft-and-develop approach still blueprint? Yes and yes. In all seriousness, I don't see a 2019 free-agent spending spree coming again anytime soon, but the Packers can make moves to give themselves flexibility to target a top free agent or two, as they've done the past couple of years. The days of being hamstrung by the Covid-cap gymnastics to make another run with Rodgers are over. Draft-and-develop remains the foundation, but Gutey always wants and plans to be in position to pursue a player or two early in free agency if it's the right player(s). Randy from Lebanon, KY In Wes's answer to Paul from Rockford's question about running backs, he stated \"Gutekunst didn't equivocate when asked about Josh Jacobs .\" I recall a similar statement being made about Aaron Jones not long ago. So, I feel taking what Gute says in a press conference at face value foolish (maybe too harsh of a word). But, if my memory serves me, Jones was a free agent. That being said I hope Jacobs is back with team. Would there be any appreciable cap savings if he was released? For the record, Jones wasn't a free agent. The Packers were reportedly working out a possible pay cut with Jones that didn't materialize, so they released him and pivoted to Jacobs. If the Packers were to move on from Jacobs, they'd save about $8M in cap space this year (plus another $13.5M comes off the books the following year), but I don't see it right now. Yes, he's got mileage and battled injuries this past year, but he's still just turning 28 tomorrow. Patrick from St. Charles, MO Can you please just help us confused fans understand where all this \"confidence\" in RB comes from? The past few years (really the past 10-plus years) are riddled with special teams failures. Yet we still have confidence in his ability? BG said it's beyond the X's and O's and about the \"culture,\" but what culture are we even talking about? The culture of a group that drops five straight games to end the season with catastrophic losses (including those due to ST)? As a fan, it's frustrating... First, it's not fair to pin any past sins on a current coach who wasn't here then. Second, it goes back to the parsing of responsibility for failures I outlined in detail at the end of the season. No reasonable evaluation can pin the botched onside kick and three missed kicks in Chicago on coaching. That's ludicrous. The individual players own those and no one else. Were there other shortcomings on special teams? Sure, but I believe the internal view is the blocked placekicks (Weeks 3 & 4) were fixed and not an issue the last three-fourths of the season, the early rash of penalties diminished as well, and the lack of a dynamic return game was mostly due to not having a dynamic returner. Plus, the Packers have a great punter and the coverage units were solid until late-season injuries to key special-teamers led to a couple explosive punt returns in the playoff loss. Look, I get the frustration. There's a lot of it amongst the fan base. But that's how the organization views the whole picture. Jeff from Littlefork, MN Speaking of cold games, what were the stats from the NFC Championship Game against the Giants? (In 2008 maybe?) Based on what was left of Tom Coughlin's nose, it looked to be near the top 10 coldest playoff games. It's in the top 10 but just outside the top five, I believe. The official gamebook says the 2007 NFC title game was minus-1 at kickoff with a minus-23 wind chill. Kickoff was at 5:42 p.m. CT and the OT field goal sailed through at 9:15, so it presumably got colder as the evening wore on. Larry from Westford, MA Not a question, but in response to your response to John from Canada, maybe all of those close games came out the way they did because the teams with the better records have those records because they are better at finding ways to win those games? There's probably some truth to that, but when you look at the games and deciding plays and how random some of those moments were, there's no denying many of the outcomes could've easily flipped. Nathan from Laramie, WY Wait what?! A separate kitchenette/lunch space for the beat reporters? From this side of the Inbox it's difficult to ascertain whether you're being rewarded or punished. Perhaps they've had enough of your lunchroom tomfoolery and shenanigans. If this is their idea of sending you all to timeout then I am truly confusticated and bebothered. The media work area Ed was talking about will be for outside media only. It has nothing to do with me and Wes, much like your creative vocabulary. Mike from Stevens Point, WI Hi Mike, \"I don't know's on third!\" Never a dull moment, right? Joe from Swansea, IL The whole time I was watching Sunday, I kept flashing back to 21-3. And thinking, if only, if only. Get on a run and get it done. And as frustrating as this season ended, I can't wait to see what 2026 holds. And how. Curt from Tampa, FL Just like that a new year dawns. All prior disappointments and frustrations are banished. Hope and expectations (reasonable and otherwise) are restored. The Packers are undefeated and all arrows point up. Happy new (NFL) year, and Go Pack Go! Happy Tuesday. Insider Inbox Join Packers.com writers as they answer the fans' questions in Insider Inbox That feels like an easy answer If only it were that simple It's not a cure-all Everyone wants to see how this Super Bowl story ends It's not too much for one offseason And the wheel in the NFL sky keeps on turning Maybe it's â¦ a little bit of all of the above The cap mandates the core philosophy A massive flaw was exposed Mike Holmgren should already be in Canton and he's not The Hall of Fame has thoroughly embarrassed itself COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "bcaf59e6c5a49009ce3793e79ca0630f008f630c6a10bfdba96a1fd821592e1a", "url": "https://www.packers.com/news/turning-the-page-feb-7-2026", "body": "The first Saturday of every month, Packers President and CEO Ed Policy will write about a topic of interest to Packers fans and the organization and then answer fan questions. Fans are encouraged to email Ed with their name and hometown at: PolicysPerspective@packers.com . As we turn the page to the 2026 season, I am extremely optimistic and confident in our football leadership â Brian, Matt, and Russ â and their ability to get the right people in the right places for us to compete for our ultimate goal, a Super Bowl championship. It goes without saying, our season didn't end the way we wanted, but the season only ends the way you want for one team. That's the business. I spent substantial time in the weeks following the season with our football leaders ensuring we are all aligned in purpose and communicating clearly and directly. I firmly believe we have the right people and a solid process for success. We have the distinct privilege of working for the Packers and everyone in our organization will continue striving tirelessly to develop and support a championship-caliber team. I am also excited about the addition of Jonathan Gannon to our coaching staff as defensive coordinator. Jonathan brings a wealth of experience from around the league to our team. He led a top-ranked defense that competed in the Super Bowl in Philadelphia before joining the Arizona Cardinals as their head coach for the past three seasons. I'd be remiss to not mention how proud I am of both Jon-Eric Sullivan and Jeff Hafley. Jon-Eric spent decades here in Green Bay with an incredible path that started as a training camp intern in 2003. Jeff made a remarkable impact during his two seasons here. They put their heart and soul into their work here in Green Bay and I have the utmost respect for each of them. Jon-Eric will be an excellent general manager, and Jeff will be outstanding in his role as head coach of the Miami Dolphins. I am proud that the Packers organization continues to develop some of the top talent in the NFL. I know our fans are disappointed that we did not advance further in the playoffs and I can assure you everyone inside Lambeau Field is more committed than ever to bringing a Lombardi Trophy home. Over the coming days and months, we are going to do everything we can to prepare our team to compete at the highest level. That process started immediately after the NFC Wild Card round. Now, let's turn the page to your questions from the last monthâ¦ Jordan from Lake Geneva, WI Hey Ed, thanks for everything you did this past season. Looking forward to seeing how your first (full) offseason in this new role goes! There is obviously a snowstorm that is expected to impact most of the country this weekend (unfortunately not everyone can handle snow as well as us in Wisconsin), which got me thinking about sledding in general and Ariens Hill in particular. My question is this: Will you be sledding down Ariens Hill this winter like Mark Murphy famously did? Thanks for the time, and good luck this offseason! Thanks for the question, Jordan. I'm glad we made it out of the snowstorm relatively unscathed up here in northern Wisconsin. I've said it before, but this time of year is my favorite around the Titletown district. Just last weekend we hosted our seventh annual Titletown Winter Games. We partnered with USA luge, curling, and biathlon, for families and kids of all ages to experience these winter sports hands-on. When we designed Titletown, we set out to bring our community together in all seasons. I'm proud that we've seen that come to fruition. To answer your main question, I will absolutely be tubing down Ariens Hill this winter. If you believe Punxsutawney Phil, you'll have about six more weeks of winter weather to enjoy skating and tubing. Although I wouldn't fully trust a groundhog, usually the weather stops cooperating between the end of February and St. Patrick's Day. Kim from Grafton, WI Dear Ed, I'm a Packer fanâ¦66 years in. I know you have a lot of decisions to make, but I do hope you keep Matt LaFleur on as head coach. He loves our organization and honestly, his season-ending press conference really solidified that for me. That man wears his heart on his sleeve, and his players care about him. I was sad how things ended this year, but with all the injuries the team experienced, we did what we could. And I'm embarrassed by all the nasty comments that are being made. No one should have to take that kind of verbal abuse. That's my two cents worth. Good luck with everything and Go Pack Go! Thanks, Kim. Matt and I were both excited to extend his contract. I have worked closely with Matt for more than seven years, and this decision was based off first-hand knowledge of that seven-year body of work. Our record with Matt at the helm is 76-40-1. Since 2019, no other coach in the NFC has won more games than Matt, and only two other coaches in the NFL have won more than him in that time. I've been at every one of those games and witnessed Matt during both the highs and the lows. Matt is a teacher first and foremost, as all great coaches are. He comes from a family of teachers, growing up watching both of his parents teach and coach. I've been especially impressed by his ability to develop talented individual players into a cohesive winning team. His work with quarterbacks is unparalleled around the league. He helped Aaron Rodgers win back-to-back MVP awards and lead our team to two NFC Championship games. He is developing Jordan Love into a top-tier quarterback, reaching the playoffs in each of his first three years as a starter. He has also been instrumental in Malik Willis achieving his potential over the past two seasons. Our players love playing for Matt and I assure you coaches like Matt are not easy to find in the National Football League. I've heard some of the same negativity you have coming out of the disappointing loss to the Bears and I understand it. I appreciate how deeply our fans care about the success of our team. They hold us to very high expectations and I wouldn't have it any other way. We are going to continue to do everything we can to meet those expectations. Football is an emotional game, and I understand the high emotions that go into a playoff game against our longest-held rival. However, in my seat, you must rise above emotions and analyze objectively an entire body of work to make a long-term decision that puts the team in the best position to compete for Super Bowls year in and year out. That's the process I went through following our season. Candidly, over the years I've grown to appreciate ownership groups that built dynasties through level-headed steadfast continuity in lieu of emotional chaos. Shawn from Cedar Falls, IA Mr. Policy! Perhaps by next column the season will have concluded or about to. 1) Do players have access to Packers facilities during the offseason? If so, why clean out lockers? Next is my suggestion for scheduling. Since preseason has taken a hit with the additional game, make the first four weeks of the season AFC vs. NFC games. They count but aren't as painful of a loss or important of a win. Then, when teams are \"warmed up\" and webs are knocked out, meat of the season runs to the end. Enjoy the column. Thanks, Shawn, for the interesting question. Players have access to the facility for our entire offseason. While \"locker clean out\" is widely used to reference the day after the season ends, it is far from players simply packing up all the equipment. Backing up to the beginning of our offseason program, our equipment crew stocks every player's locker with the necessary gear, shirts, shorts, gloves, etc. Then at the start of training camp we restock everyone's locker with the on-field gear for that season. This gear and personal items accumulate throughout the season and at the end of the season is when players take time to tidy up. Many players take any necessary equipment with them so they can train with teammates offsite or wherever they may spend some of their offseason. However, gameday necessities like helmets and shoulder pads are left here and reconditioned so they can be ready to go when the next offseason program starts. As for this offseason, we are continuing to invest heavily in our football space, ensuring it is state of the art. We are currently renovating our equipment room for the first time in 20-plus years and our athletic training room, which was last updated in 2014. We're also rebuilding a brand-new media space. By the NFL Draft, our beat reporters will be welcomed back to a new media auditorium, private office space, and their own kitchenette/lunch room, which are accommodations that are becoming increasingly rare around the league. On your scheduling question, that's an interesting thought. As you know, as of late, we've recently started with either divisional or conference opponents. I think preseason is a way to get warmed up so we are ready to go. As you saw in September, we opened the regular season with a win against a division rival (Detroit Lions) followed by a win against a conference foe (Washington Commanders) just four days later. Mason from Manitowoc, WI Mr. Policy, thanks for doing this column. Obviously, disappointing loss against the Bears but feels like we are close to making a breakthrough. I imagine you all have to begin preparing for an event as big as the Super Bowl well in advance. Now that we aren't making it, what exactly happens? Do you go even if you are not competing? Imagine it'll be nice to get back to Bay Area if you still have family there! I appreciate your question, Mason. You are correct there is a lot of prep work that goes into the Super Bowl even if you aren't playing in the big game. Every club sends representatives and usually their owners to the Super Bowl. There are numerous events throughout the week that lead up to the game where owners and leaders from different teams celebrate the season and connect and network with potential business partners or sponsors. Much like an away game, it's a business trip with numerous events scattered about like NFL Honors, the commissioner's reception, and various meetings. While it will mostly be a work trip, I do have family in the area, so I'll be carving out an evening while in San Francisco to connect with my dad over dinner. Chris from Hartford, WI Ed, what are your thoughts on the Steelers hiring Mike McCarthy? You must have interacted with him while he was with the Packers. Mike McCarthy is one of my favorite people in the NFL and I couldn't be happier for him and the Pittsburgh Steelers. I worked closely with Mike for seven seasons. He is originally from Pittsburgh, less than an hour away from where I grew up in Youngstown, Ohio. Mike and I would frequently talk about our hometowns and the people that called that part of the country home. The integrity and grit of people who hail from that region is second to none. We both have a tremendous respect for the Steelers and the Rooney family. In my opinion, the Rooneys are the architype for owners in the National Football League. During Mike's time in Green Bay, he had a tremendous impact on our organization and our community and most notably delivered a Lombardi Trophy to Green Bay. I'm reminded of that every morning when I take a left on Mike McCarthy Way on my way into work at Lambeau Field. To go from coaching the Green Bay Packers to the Dallas Cowboys to the Pittsburgh Steelers is truly legendary. Mike is one of one. Policy's Perspective is a monthly column written by President and CEO Ed PolicyÂ Policy's Perspective is a monthly column written by President and CEO Ed PolicyÂ Policy's Perspective is a monthly column written by President and CEO Ed Policy Policy's Perspective is a monthly column written by President and CEO Ed Policy Policy's Perspective is a monthly column written by President and CEO Ed Policy COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "a9f60162a09f22a394612780d469e0a7d9c4e3d0f66f07b91b87c262dd12de97", "url": "https://www.packers.com/news/packers-punter-daniel-whelan-to-visit-ireland-and-the-uk-feb-5-2026", "body": "As the Green Bay Packers look to grow the team's international presence, one of the stars of the 2025 season is preparing to embark on a special tour through Ireland and the UK. Irish-born punter Daniel Whelan will visit several cities in the Irish and British markets beginning Tuesday, Feb. 17. With a variety of activities planned, Whelan will participate in local events and media engagements designed to connect with fans and experience the region's rich sports culture firsthand. \"I'm so excited to spend time with Packers fans in Ireland and the UK on this unique trip,\" said Whelan. \"Being born in Ireland and spending half my life there, plus having my dad living in the UK, I already have special connections to many places in Ireland and the UK. I'm looking forward to creating even more. Sports play such a central role in culture and tradition on both sides of the Atlantic, and I can't wait to celebrate that shared passion while helping to grow the Packers' presence internationally.\" The tour will kick off in Dublin, Ireland, and will be highlighted by a special, invitation-only fan event, the Green & Gold Gathering, hosted at The Wool Shed Bar and Kitchen, on Wednesday, Feb. 18. Moderated by sportscaster and media personality Olivia Harlan, the event is in collaboration with the UK and Irish Packers fan club and will bring Packers fans together for a conversation with Whelan centered on football, fandom and the team's unique culture. Though the Green & Gold Gathering is intended for invited guests only, there are a limited number of tickets available through a sweepstakes. Fans located in the UK and Ireland who have the Packers designated as their favorite team through their account on NFL.com will receive an email inviting them to register for a chance to win tickets. Following his time in Dublin, Whelan will make stops in Glasgow and Newcastle before ending the trip in London. In each location, he may meet with local athletic organizations, participate in media appearances and attend sporting events as schedules allow. Whelan, who just completed his third season as Packers punter, came to Green Bay in 2023 after a standout season with the D.C. Defenders of the XFL, becoming the first Irish-born NFL player since 1985 and having an immediate impact for the Packers. Despite the challenge of punting in Green Bay's cold temperatures and winter conditions, he has excelled, becoming one of the NFL's top punters. He made history in 2025, reaching the top of the Packers' record books after shattering the team's single-season records for both gross (51.7 yards per punt) and net (43.9) punting average. His gross average ranked No. 1 in the NFL and marked the first time a Green Bay punter has led the league in the category since the 1970 NFL-AFL merger. He has registered three of the top four single-season averages for punting in franchise history, posting a 46.2-yard average in 2023 (No. 3), a 46.1-yard mark in 2024 (No. 4) and a team-record 51.7-yard average in 2025. Completed waivers required to participate; attendees invited to bring hygiene items to donate to the Help for the Homeless Hygiene Drive Award funded through the NFL Foundation to honor law enforcement officers Grant to help lower registration fees or provide scholarships for players in need Food and beverage crawl to feature live entertainment, winter activities, photo ops and exciting prizes Free to the public, event will feature story time with Cameron Moreland, a reading by a Packers celebrity and a reading in Spanish New this year, applications now accepted from February to April 1; 2026 grants will go toward programs focusing on animal welfare, homelessness, human services Head Coach Matt LaFleur made the announcement Monday GM Brian Gutekunst, Head Coach Matt LaFleur and Executive VP/Director of Football Operations Russ Ball signed to multi-year contract extensions Presented by U.S. Venture, Titletown Winter Games will offer luge, curling, ski jumping, biathlon and figure skating Nixon earns first career selection, replaces Seattle Seahawks CB Devon Witherspoon Green Bay signs DL Jaden Crumedy, QB Kyle McCord to reserve/future contracts COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "6b385c542d51057622062e12f2cc4b9aa66a5c03270b60228567e7472b0b9513", "url": "https://www.packers.com/news/brian-gutekunst-provides-update-on-state-of-packers-roster-feb-5-2026", "body": "packers.com senior writer GREEN BAY â During his nearly 40-minute news conference on Wednesday, General Manager Brian Gutekunst provided key comments on several Packers players. Here are some updates from Gutekunst as Green Bay embarks on a crucial offseason. Quarterback Jordan Love didn't require post-season surgery. For the most part, the Packers' starting quarterback finished the season healthy despite spending most of it on the injury report. Love missed the second half of training camp after undergoing a procedure on his left thumb. He then injured his non-throwing arm against the New York Giants in November before sustaining a concussion against Chicago on Dec. 20 that knocked him out of Green Bay's Week 17 game vs. Baltimore. Despite that, Love had his best statistical season throwing the ball. He fashioned a 101.2 passer rating with the best touchdown-to-interception ratio of his career (3.8-1). Love also tied Brett Favre's franchise record with 20 straight completions against Pittsburgh in Week 8. Love was also a bright spot in the Packers' disappointing 31-27 wild-card loss to the Bears, completing 23 passes for 323 yards with four touchdowns and no turnovers (103.8 passer rating). \"I thought Jordan played really, really good football; some of his best football, especially down the stretch,\" Gutekunst said. \"He continues to be an unbelievable leader for our football team. Couldn't speak more highly of what I think about Jordan and where he's headed. As good as he's been for us, I do think he'll continue to get better because it's important to him and he works at his craft. He's always looking for another edge.\" Micah Parsons ' impact went well beyond his All-Pro season. The Packers acquired Parsons in a blockbuster trade with the Dallas Cowboys in hopes of securing a generational pass rusher to build their defense around. They wound up getting much more than just that. The 6-foot-3, 250-pound defensive end not only racked up 12Â½ sacks in 14 games en route to his fifth straight Pro Bowl year, but Parsons also became a respected voice in the locker room. Even after undergoing surgery to repair the torn anterior cruciate ligament he suffered against Denver in Week 15, Parsons was still in attendance for the Packers' playoff game in Chicago. \"He's super impactful to our football team,\" Gutekunst said. \"The thing that was really nice to see was how he fit within our group, because you never really know how that's going to work. We knew the player. We knew when we put him out there the difference he would make on the field. But seeing the difference he made in our locker room and how he fit into our culture here and really enhanced our culture I think was really a pleasant surprise for me.\" Zach Tom 's knee injury shouldn't affect his 2026 availability. The Packers' right tackle told reporters after the season he was leaning towards having surgery to repair the partially torn patellar tendon he suffered against Denver in Week 15. Tom, who signed an extension with Green Bay in July, proved difficult to replace. The Packers won just one of the six games they played without Tom, who also missed two September starts with an oblique injury. The fourth-year veteran gutted it out to make 12 starts before the knee injury ended his season. Despite the surgery, the Packers believe Tom will be ready for the 2026 regular season. \"Really proud of Zach and how hard he fought to get out there and play with what he was dealing with,\" Gutekunst said. \"He's gonna be on the shelf here for a little while during the offseason, but I wouldn't really expect it to impact his 2026 season.\" Packers have already started talks with Tucker Kraft on a potential contract extension. The third-year tight end was well on his way to his first Pro Bowl season before tearing his ACL against Carolina on Nov. 2. Prior to the injury, Kraft was Green Bay's leading receiver with 32 catches for 489 yards and six touchdowns in eight games. With Kraft entering the final year of his rookie contract, Gutekunst said the Packers have already spoken with the 6-foot-5, 259-pound tight end regarding his future. \"Obviously, he's a really important part of this football team,\" Gutekunst said. \"Certainly, the impact that he has on our football team, not only as a player but as a leader, is very important to us. We've obviously already been in contact with him and just let him know how we feel and we'll kind of see how it goes.\" Jordan Morgan proved something to the Packers during challenging 2025 season. Gutekunst was impressed with how Morgan handled a tumultuous sophomore campaign in which the 2024 first-round pick made starts at four different positions (seven at right guard, two at left guard, three at right tackle and one at left tackle). A three-year starting left tackle at Arizona, Morgan competed for the starting job there during training camp before incumbent Rasheed Walker kept the job. With Walker set to become an unrestricted free agent in March, Gutekunst was asked whether it would be preferable to insert Morgan at his natural position instead of moving him around. Ideally, Gutekunst agreed, that would be the plan, but it's also somewhat unrealistic given the challenges of keeping a starting offensive line intact. \"I do sometimes think if you can keep a guy on a side, left or right, it's helpful for him a little bit,\" Gutekunst said. \"But his versatility has helped us, and it was one of the reasons that drew us to him in the draft, and his ability to play all those spots has been a benefit to us, but certainly he's going to get a lot of opportunity. \"I thought he played really well in the preseason at that (left tackle) spot, probably did enough to win that job, but then we had some injuries and had to do what was best for the team.\" Packers are looking to add cornerback depth this offseason. Perhaps no position on the Packers' roster was stressed more by injuries than cornerback, with Nate Hobbs , Bo Melton and Kamal Hadden all finishing the year on injured reserve. Gutekunst praised the unit's performance despite the injuries, commending Keisean Nixon for first Pro Bowl season and Carrington Valentine for stepping up in Hobbs' absence. He also left the door open for a Hobbs return in 2026 after knee injuries derailed his first season with the Packers. In the big picture, however, Gutekunst acknowledged the need to deepen the coffers at a position with a high risk of injury. \"I think again we had some injuries there,\" Gutekunst said. \"Do we need wholesale changes? No. I do think it's an area â those guys can get hurt. They're the smaller guys on the field. We ask a lot of those guys in run support. The depth there, for me, is important that we have answers.\" Matthew Golden made the most of his opportunities. The 5-foot-11, 191-pound receiver finished his rookie season on a high note, catching four passes for 84 yards and scoring his first NFL touchdown during the playoff game against the Bears. It wasn't always easy for the rookie first-round pick to get on the field, especially once Christian Watson and Jayden Reed returned from injury. But after watching Golden catch 29 passes for 361 yards in the regular season, Gutekunst sees big things ahead for the receiver in Year 2. \"I thought he did an excellent job,\" Gutekunst said. \"Like all players, when you go through tough times when you're losing games and maybe you're not getting as many opportunities as you want, that's going to be frustrating, but I thought he handled it like a pro and, when his number was called on, he performed.\" The Packers have the latitude to be active in free agency. Despite inking Love, Parsons and Tom to top-of-the-market deals over the past 18 months, Gutekunst still feels he has ample room to be active in March if the right players are available. \"I feel really good,\" Gutekunst said. \"A lot of that will be dependent on the decisions we make with the roster right now and what we do. But I believe we have all the flexibility to do what we need to do.\" Packers quarterback donated nearly 2,000 pairs of cleats to local youth sports teams in 2025 He was first Green Bay punter to lead NFL in gross average since 1970 QB Jordan Love has yet to play at Lambeau Field in postseason Packers defensive lineman rehabbing from season-ending ankle injury Bethune-Cookman product was member of Green Bay's Super Bowl XLV championship team Jayden Reed, Christian Watson discuss two plays that got away Packers right tackle leaning towards surgery on partially torn patellar tendon Third-year pro had potentially historic season interrupted by knee injury All-Pro pass rusher rehabbing from torn ACL, eyeing September return Team resolved to make playoff disappointment count for something in the future Packers head coach addressed the media Sunday afternoon COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "a0a404dedc2e98b51864f6cb4815cc2c9e7b72da338e049d53dd287de1f8b81b", "url": "https://www.packers.com/news/inbox-that-s-the-way-this-game-is-played-feb-5-2026", "body": "packers.com senior writer Ryan from Mount Zion, IL 272 games in a season with one ending in a tie. So, 271 had a winner and a loser, but since 271 is a prime number, half were not won or lost? The math is hurting my brain. It must be why math was banned a long time ago. If Inbox was Family Feud, this would have been the most popular answer on the board today. I also believe this would qualify as a self-inflicted wound. That's the last time I tempt mathematical fate. Jon from Willmar, MN Thanks for the Jonathan Gannon article . With his background, the defense should be great. How are our injured players recovering? Who should be back Week 1? Micah Parsons seems to be in good spirits at the Pro Bowl Games. In all seriousness, Brian Gutekunst provided updates on several injured players during his 38-minute news conference Wednesday. I have a story posting this morning on packers.com. Jennifer from Middleton, WI Wes, were you surprised by Gute's dismissive response that team experience and age had nothing to do with our ability to finish? I've heard many former players talk about the best teams being player-led and how important the strong-resumed vets' cache is toward ensuring accountability and staying locked in, way more than coaches. We are lukewarm in that area. There are benefits to youth, but it's obviously one of those intangible factors and I'd have liked for him to acknowledge the tradeoffs. Correlation doesn't imply causation for me. There are plenty of reasons why the Packers struggled to finish games. Gutekunst outlined a few of them , but I don't think it was due to too few veterans. It certainly wasn't because of a lack of experience, either. Shoot, New England barely has any and the Patriots made it all the way to the Super Bowl. In my opinion, what hurt Green Bay most was not having its best players available in concert with one another. Every team battles injuries, but it seemed like the Packers always had two or three of their top 5-7 players missing from Week 1 on. Tommy from Washburn, WI I'm seeing a lot of people assuming that Malik Willis will be a starter next year, but I don't think it's a guarantee. He has been nothing short of amazing as our QB2, but I think equal credit goes to Matt LaFleur's scheme and play-calling when Willis was in for Jordan Love . If another team signs him, Willis will still need to compete for the starting job. Matt Flynn never became a starter, so I don't think it's guaranteed. Do you see any world in which Willis is back in GB next year? I sure hope so. Go Pack Go! Willis may not be proclaimed a starter on the day he signs, but he will get the opportunity to compete for a starting job somewhere like Flynn did. In addition to 2026 not being a great quarterback draft, Willis played too well for a QB-needy team not to take a deeper look. Even if the starting scenario doesn't play out, top QB2s are still making $7-8 million now. It's gonna be tough for the Packers to retain Willis regardless. Dylan from Amery, WI What do you think about taking a late-round flyer on Paul Blake, QB from Texas State. Gritty, good leader. If the Packers don't acquire a quarterback in March, I'm sure they'll look to draft one in April. Willis' magic was too powerful not to replace. Paul from Rockford, IL Are the Packers going to be looking at RB in the early rounds of the draft? Gutekunst didn't equivocate when asked about Josh Jacobs on Wednesday. He feels the three-time Pro Bowler still has good years ahead of him. So, the rest comes down to depth and how Green Bay handles Emanuel Wilson as a restricted free agent. If Wilson returns and the organization feels it has answers to MarShawn Lloyd 's issues, the Packers are probably best served to use their Day 2 picks elsewhere. If Wilson isn't back and Lloyd's situation remains precarious, then RB might be a position Green Bay needs to consider. You need three solid backs in LaFleur's offense. That's the way this game is played. Paul from Ledgeview, WI Wes, yesterday in II, Mike mentioned four areas for improved performance, three of the four on defense. If you are Brian Gutekunst, do you go all-in to fix one side of the ball with the belief for instance that the offense could carry the team, or do you try to make improvements across the board? Where is the strength in the draft this year? Do you think BG crafts his draft strategy to capitalize on positions of strength in a draft class? This appears to be a strong draft on the defensive side of the ball, particularly at defensive end, cornerback and linebacker. The Packers probably don't have the capital to go \"all-in\" on one phase or position. They will likely wind up with eight picks, half of which will be in the final two rounds. You gotta make 'em count. Gordon from Newport Beach, CA Perhaps it is difficult to quantify, but what turns a CB from a commodity into a luxury elite player? When a cornerback impacts the game like a pass rusher. I think that's when the shift occurs. Before the injuries, Jaire Alexander could alter the momentum of a game with his play. Those corners are few and far between, and Alexander was a two-time All-Pro because of it. Gutekunst feels Green Bay is in a good spot with Keisean Nixon , Nate Hobbs and Carrington Valentine , but the Packers admittedly must add depth. That starts with casting a line or two into draft waters in search of the next Alexander or Tramon Williams. Jeffrey from Eveleth, MN If Gutey trades out of the second round and into the early third round, what would that net us? Probably an extra third or a fourth and Day 3 pick. Ryan from Oshkosh, WI Will we see any of our free agents signed before free agency starts? I am curious who will stay and who is going to go. Once the clock hits zero on the Super Bowl, you never know when a deal might go down. Mason Crosby signed a contract extension on Feb. 23, 2020. Last year, Isaiah McDuffie re-signed nine days before the start of free agency and Brandon McManus was two days after that. Nolan from Scandinavia, WI Anyone else feeling blah about this year's Super Bowl? I have no dog in this fight. I like Mike Vrabel and based on what I've read he is a standup guy, so I'd be OK seeing him win a ring as a HC. I also appreciate Sam Darnold's career trajectory. Also, a lot of GB connections with both teams but I haven't been this uninspired to watch a Super Bowl in years and that's including ones after GB NFC Championship Game losses... I'd agree it's not exactly Hulk Hogan facing Andre the Giant. The matchup definitely lacks something, but this is still the biggest game in our sport. Everyone wants to see how this Super Bowl story ends. I'm sure I'll watch unless the game turns into an unmitigated blowout. Mike from Baraboo, WI Who do you predict will win the Super Bowl and the Super Bowl MVP? Seattle and JSN. Carl from Sheboygan, WI Morning II, with all the talk of going to 18 games, no preseason, an additional bye week, etc., would it not make sense then to allow some \"flexing\" of the roster by (as with baseball) all teams are allowed to expand their rosters by (say) five players starting in December? This could help banged-up players to get some needed rest. I know they have the freedom today to bring players up from the practice squad, and they can pull any player from any other team's practice squad (correct?). Thoughts? That's an interesting idea, but I don't see the NFL modifying its current structure. The league's counter to a longer regular season was expanding the practice squad to 17 players and allowing up to two players to be elevated to the gameday roster each week. Keep in mind the benefits differ for players on the active roster and practice squad. I'm sure that's part of the calculus for the league and its club owners. Mark from Bradenton, FL Good morning, Wes. Purely hypothetical question: There is speculation that the Seattle Seahawks may be up for sale after the Super Bowl with a selling price between $7-8 billion. Would a consortium of Taylor Swift/Kelce Brothers be able to afford that amount? I would think the NFL owners would look favorably on such ownership. Lewis Hamilton owns a share of the Broncos. Tom Brady has a piece of the Raiders. It's a near-certainty that a celebrity will be part of the Seahawks' next ownership group. Whether the Swift-Kelce consortium gets involved, your guess is as good as mine. Kerry from Lakewood Ranch, FL We southern Packer fans were looking forward to two games in our region this year. What a shame if the Packers don't get to play in New Orleans if that game is moved overseas. Would you agree the New Orleans venue is top five in the league? I would disagree with that, but I love New Orleans as a city. Considering the Saints are in the NFC, it's strange that I've covered just one game at the Superdome (2014) during my 14 years on the beat. If memory serves, the Saints could motion for that game to be played in New Orleans, though. The Chargers protected their home game against the Packers in 2019 for that reason. Charlie from Morgan Hill, CA There are some things that need immediate attention in the NFL that won't happen. Officiating issues are one. But I was surprised to see that there are 10 new head coaches and not one is African American (assuming Kubiak goes to Vegas). Only Robert Saleh is a man of color. The Rooney Rule is clearly toothless. What are your thoughts? This must be frustrating for qualified coaches of color. I am surprised. I thought for sure Brian Flores would get another opportunity. I don't know what the answer is, but it was startling how few Black head coaches seemed to be serious contenders for head NFL jobs. Did Vance Joseph even get an interview? One name I'd like to see get more traction hopefully next year is Ejiro Evero, a Dom Capers mentee who's worked wonders with Carolina's defense. Matt from Albert Lea, MN After seeing the head coach, GM, etc. get extensions, I was curious if all of their salaries are fully guaranteed for the entire contract? If so, do most or all teams have fully guaranteed contracts for their GMs and head coaches? Correct, though coaches and GMs can be fired \"for cause.\" See Al Davis' infamous news conference after the Oakland Raiders let Lane Kiffin go. Tim from Charlotte, NC Regarding Mark from Appleton's question about heated seats in Lambeau, a few years back I took the stadium tour and learned that the seats are actually heated. Yep, it's true, our guide told us. \"They heat them every June, July, and August.\" Oh, I get it. It's very clever. Jason from Boyle, MS I can't even process the idea of Green Bay having a roof. Fortunately, you don't have to. Not in our lifetime, at least. Jason from Rochester, NY Is there a place to send the league a recommendation for a Pro Bowl activity for next year? Let's get all the ACL/Achilles injured players to race their scootersâ¦ I've had my fill of corgi races. Bust out the Buzzarounds. Juan from Miami, FL Kurtis...\"The reality is there are still 272 games each regular season. Half will be won and half will be lost. Actually, all will be won and all will be lost.\" I am sorry, however, there will be ties...Now that is why there is the rule \"No Math in II.\" Now is probably a good time for us to break. In accordance with the Packers' companywide initiative to take a long weekend over the Super Bowl, this will be the final Insider Inbox until Tuesday, Feb. 10. Mike's got you next week as I knock out some PTO. Enjoy the big game, folks. Hopefully, our last without GBP involvement. HAVE A QUESTION? Insider Inbox Join Packers.com writers as they answer the fans' questions in Insider Inbox That feels like an easy answer If only it were that simple It's not a cure-all Happy for him and proud to know him It's not too much for one offseason And the wheel in the NFL sky keeps on turning Maybe it's â¦ a little bit of all of the above The cap mandates the core philosophy A massive flaw was exposed Mike Holmgren should already be in Canton and he's not The Hall of Fame has thoroughly embarrassed itself COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "cc653485d10f8702327bb68240610614791e95c29234520697434e1875f1ae1f", "url": "https://www.packers.com/news/5-things-learned-from-packers-gm-brian-gutekunst-s-news-conference-feb-4-2026", "body": "packers.com editor GREEN BAY â General Manager Brian Gutekunst's season-ending news conference took place a couple weeks after it normally does, but he spoke with the media for nearly 40 minutes on Wednesday in the Legends Club at Lambeau Field. Here are five big-picture things learned from the session: Multiple times, Gutekunst referenced losing five straight games to conclude the season. He also lamented being in position to win games the Packers didn't, including of course the NFC Wild Card playoff at Chicago. He admitted how difficult it has been to process such a rough finish, and losing second-half leads was obviously one common thread. \"Finishing games is certainly something that we've got to concentrate on as we head into the 2026,\" he said, before specifically referencing the Bears playoff loss again, when a 21-3 halftime lead vanished. \"Certainly we played very, very well in the first half and had a lot of things in front of us. And when you get in situations like that, you expect to win the game.\" The blame is shared, and one focus of the offseason will be examining from all angles how very winnable games â five times the Packers had multi-score leads in games they didn't win â got away. \"It's all of us, right? It's players, it's coaches, it's everybody,\" he said. \"In certain football situations, we have to be better, and we have to be more consistent. \"For me, there's two things. One, do we have the right people out there that can handle those situations? And then two, are we doing everything to give them the best chance to succeed? We're looking at it from all avenues.\" The last two seasons, the Packers have been one-and-done in the playoffs, and not entering the playoffs playing particularly well, either. That's a change from prior years in the tenures of Gutekunst as GM and Matt LaFleur as head coach, and they're looking closely at why the team hasn't peaked for a stretch run. \"In Matt's first five years, we were 25-8 in December and January,\" Gutekunst said. \"I think we're 3-9 the last two years, so we're looking at that from a lot of different angles, to make sure that we're playing our best football in December and January. \"We've got to win the games that matter the most. That was a strength of ours prior to these last couple of years, was how we finished. We were playing our best football at the end of the season. We haven't done that the last two years.\" The team's 9-3-1 mark heading to Denver in mid-December had it set up well, and Gutekunst felt the Packers actually hadn't \"played particularly great football\" up to that point. So there was optimism they could take another step, and while injuries certainly played a role in the slide, there was enough good football despite the injuries to believe the results should've been better. \"I thought we had an opportunity to kind of round into form there in the second half of the season, and obviously it didn't work out that way,\" Gutekunst said. \"I did think there were moments that we played at a very, very high level, championship-football type level, but it wasn't consistent enough. We didn't sustain it. \"As we go into this offseason, we continue to evaluate 2025 before we get on to 2026. It's on the front of our minds.\" The Packers lost tight end Tucker Kraft in early November and defensive lineman Devonte Wyatt on Thanksgiving, plus stalwart right tackle Zach Tom and defensive star Micah Parsons in mid-December. No one's denying those players couldn't have made a difference down the stretch, but Gutekunst doesn't feel their absence is why the Packers struggled. \"I felt through the end of the season and into the playoffs we had everything we needed to win those football games,\" he said. \"I never felt underhanded at any time going into those games.\" That mentality has been forged, in part, by being on the Packers' scouting staff during the team's last Super Bowl run in 2010, when the roster was decimated by injuries and the team still found a way to get hot at the right time. \"I got one ring since I've been doing this, and it was the year that we had more injuries than I think any other, right?\" he said. \"So, it's nothing against any other teams here, but you never feel like, 'Hey, we can't go win this game,' you know? I fully expected where we were in the middle of the playoff game, to win that game and be heading to Seattle and win that game. \"That's the thing that makes this job, as tough as those moments are, it's what draws us a lot to it, is the competitive nature of it.\" As the Packers' defensive coaching staff gets revamped amidst coordinator Jeff Hafley's departure to Miami as head coach, Gutekunst's comments on Bisaccia indicate no change is forthcoming with the third phase. \"What Rich brings to our culture, this football team, he's a very impactful coach around here,\" Gutekunst said. Special teams miscues played a role in the season's tough finish, and Gutekunst noted kicker Brandon McManus had made 32 straight kicks (13 FGs, 19 PATs) before his three misses in the playoff loss. The botched onside kick in the previous game at Chicago was not discussed, nor was the lack of a dynamic return game late in the season. But Gutekunst gave shout-outs to the team's coverage units as well as punter Daniel Whelan and long snapper Matt Orzech as providing stability and a strong foundation. \"I've got a lot of faith in Rich and his staff, what they do around here, not only the X's and O's, what they bring to the field, but what they bring to this place culturally is really important,\" he said. New President and CEO Ed Policy recently extended the contracts of Gutekunst, LaFleur and executive VP/director of football operations Russ Ball, keeping the continuity that's been in place as the Packers have qualified for the playoffs in six of the past seven seasons. That trio has been tasked, and trusted, with getting the team to take the next step. Of the three, Gutekunst has been here the longest by far, working as a scouting intern back in 1997 and spending all but one year of his career since in Green Bay. He'll be moving forward now without one of his top personnel lieutenants, Jon-Eric Sullivan, who's the new GM in Miami, the type of departure Gutekunst had been prepared for, so he doesn't see it materially disrupting the operation. \"I've been here a long time, worked here a long time, lot of contracts here, and I'm always just exceptionally appreciative of the opportunity to walk in these doors and continue to try to chase what we're chasing,\" Gutekunst said. \"This is a very, very, very special place. It's very, very important to me, and certainly sitting here after five losses, you feel very frustrated where we're at, but very appreciative with the opportunity that Ed's given us.\" Gutekunst threw his full support behind LaFleur, too, highlighting a close working relationship with him as well as Ball that has kept the football leadership in sync. \"He's an excellent football coach,\" Gutekunst said of LaFleur. \"To get where we're going, he's the guy we need. I think he's as eager as anybody to get back at it. \"Nobody's really satisfied obviously with how the season ended. We've been through this before, where as soon as the season ends, you want to get started on the next one because you're just not satisfied with where we want to be.\" Gannon led Philadelphia Eagles' dominant defense in 2022 Former first-team All-Pro played four seasons with Micah Parsons Fourth-year veteran started his career with Green Bay in 2022 Green Bay added two veterans after Devonte Wyatt's season-ending injury Former fifth-round pick has spent season on Green Bay's practice squad Three-time All-Pro shares unique distinction with Reggie White Fifth-year player is very seasoned on special teamsÂ Notes on specific positions as Week 1 nears Decorated college tackle has played guard in NFL Luke Musgrave, Tucker Kraft shine vs. Seahawks, Xavier McKinney returns Keisean Nixon keeps grinding away, Brandon McManus has some fun COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "50006a66b6f10e526443a949f77889e9b8db1be90cbd8d79a1e9121b174e198d", "url": "https://www.packers.com/news/lambeau-field-to-host-timeout-for-reading-literacy-event-march-14-2026", "body": "The Green Bay Packers will host the literacy-themed event, \"Timeout for Reading,\" at Lambeau Field on Saturday, March 14, from 9 a.m. to noon. Free to the public, Timeout for Reading will feature story time with Cameron Moreland, NBC 26 Chief Meteorologist, a reading by a Packers celebrity and a reading in Spanish. Free books and bookmarks will be distributed at the event to kids in pre-K through 5th grade while supplies last. Emplify Health by Bellin, Howe Community Resource Center, NBC 26, and Oneida Reads will also take part in the event by offering different literacy activity booths for attendees to enjoy. Special reading areas will be available for participants to read their free books or a book brought from home. The event can be accessed through the American Family Insurance Gate or the Miller Lite Gate on the east side of the Atrium. \"Timeout for Reading\" is one in a series of community events held each year as part of Green Bay Packers Give Back , the Packers' all-encompassing community outreach initiative. Combined with other Green Bay Packers charity endeavors, the event contributes to a comprehensive Packers charity impact that was in excess of $13 million last year . 'Timeout for Reading' Entertainment: Completed waivers required to participate; attendees invited to bring hygiene items to donate to the Help for the Homeless Hygiene Drive Award funded through the NFL Foundation to honor law enforcement officers Grant to help lower registration fees or provide scholarships for players in need Food and beverage crawl to feature live entertainment, winter activities, photo ops and exciting prizes Whelan to connect with Packers fans and local sports communities as team continues to grow its presence in Ireland and the UK New this year, applications now accepted from February to April 1; 2026 grants will go toward programs focusing on animal welfare, homelessness, human services Head Coach Matt LaFleur made the announcement Monday GM Brian Gutekunst, Head Coach Matt LaFleur and Executive VP/Director of Football Operations Russ Ball signed to multi-year contract extensions Presented by U.S. Venture, Titletown Winter Games will offer luge, curling, ski jumping, biathlon and figure skating Nixon earns first career selection, replaces Seattle Seahawks CB Devon Witherspoon Green Bay signs DL Jaden Crumedy, QB Kyle McCord to reserve/future contracts COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "85680d391ef884e0365c88ed9f0f7d5359e25d427364200acab527a1a32dca1f", "url": "https://www.packers.com/news/inbox-doesn-t-seem-worth-anybody-s-outrage-feb-4-2026", "body": "packers.com editor Kurtis from Macungie, PA \"The reality is there are still 272 games each regular season. Half will be won and half will be lost.\" Actually all will be won and all will be lost. And once again, the Inbox justifies its own no math rule. Rick from San Diego, CA So you are saying we can't get a second-round pick by trading a bunch of much lower picks with lesser value? There was a certain assistant to the traveling secretary that might disagree with you. He had a way to acquire Bonds and Griffey without giving up that much. Did it involve Jay Buhner or Ken Phelps? Ray from Phoenix, AZ Say the highest rated player on the Packers' board when they pick in the second round is a receiver. Do you see them trading down to get more picks, or is this the year they go to a position of need and take the highest-rated corner, D-tackle or O-lineman on their board? Unless there's a clear best available player at a position of need when the Packers are on the clock, I think the odds are good they'll look to trade down to acquire more picks. But that also doesn't mean it's guaranteed to happen. It always takes two to tango. Brian from Manitowoc, WI Greetings II. Longtime first time. If the Packers organization doesn't divulge the head coach or GM contract details, specifically the number of years, then is this a new practice? How did we all come to know the duration and expiration of both Gutekunst and LaFleur's previous contracts and their expirations? Thanks for all the great writing. It's not new, and reporters have found out on their own in the past. In this last go-round, it was eventually reported the previous extensions Mark Murphy signed with Gutey and LaFleur were intentionally structured to expire two years into the tenure of Murphy's successor. But that wasn't known right away. Brian from Charlottesville, VA Would Matt LaFleur ever consider inviting Mike LaFleur and the Cardinals to be training camp partners? Wouldn't rule it out. Barb from Marengo, IL Well, it looks like every team next season will be playing at least one overseas game. Where would you like to travel to? I think half the league is probably more accurate, and I don't spend much time thinking about it unless and until I know where we're going. Barry from De Pere, WI Saw the Saints would play at the Stade de France this year. If the Packers are chosen as the opponent, we can rest easy knowing the field is Desso GrassMaster, same as Lambeau. Better than that horror in Sao Paulo against the Eagles. I suspect the NFL has been, and will continue, looking more closely at all surfaces in new international venues after the inaugural Brazil affair. Bill from Menominee, MI It was speculated that when former defensive coordinator DeMarcus Covington was hired by the Packers as a position coach, that he would be a potential candidate for GB's DC role should Hafley move on for a head coaching job. Are you aware if Covington was considered for the position prior to their eventual hiring of Gannon? Not sure. It was reported Covington got multiple interviews with other clubs for their open DC positions, but whether or not LaFleur interviewed him before hiring Gannon, I don't know. Kevin from Arlington Heights, IL Would you say it's easier for a defense to pick up on a completely new scheme than for an offense to learn an entirely new playbook? Probably, just because an offense has a greater spectrum of variables â formations, motions, cadences â that a defense reacts to more than learns its own versions. Shawn from Colby, WI Mornin' Spoff. Michael from Jacksonville asked yesterday about why the runner on an outside run doesn't just throw the ball downfield or out of bounds if he isn't going to get back to the line to gain. I wondered that for a while myself but then realized on a running play, someone on the OL is likely downfield blocking, thus, it would be a penalty for \"illegal man downfield.\" Do I have that right? Pretty much. Don from Thompson, ND When the NFL turns preseason games into regular-season games I see an unintended consequence occurring. Previously the preseason was the opportunity for young or undrafted players to show they deserve a roster spot, but now that the games count their chance to shine is lessoned. Teams may decide to stay with an aging, diminishing-skills player rather than risking a roster spot on an intriguing but now unproven player. In this new world would a player like Sam Shields possibly not get discovered? Not necessarily. Joint practices have taken the place of preseason games and those opportunities are still there for young players. It's not the same as a preseason game, but it's close. Ian from Kirkwhelpington, UK Mike, I have read in various places that the Packers will almost certainly not tender Emanuel Wilson but seek to sign him to a cheaper one-year contract instead. Given his play over the last two years, is he not worth a two- or three-year deal, or will Wilson spend his career on one-year deals? Well, first off, an RFA tender is a one-year deal anyway, and a multi-year deal doesn't necessarily mean anything if there's no guaranteed money beyond the signing bonus or first year. But bigger picture, it isn't necessarily in the best interests of a player like Wilson to sign for multiple years anyway. Any backup waiting for an opportunity to be a featured guy â whether that comes via injury or another avenue â needs to be able to cash in as soon as he proves himself, and playing on one-year deals is the only way to keep those options open. Michael from Mesa, AZ What's the one position group that has to take a clear step forward for the Packers to make a legitimate playoff run next season and why? I don't think it's one. If it were just one, the Packers would've been better than the No. 7 seed and wouldn't have gotten bounced in the first round. It's the O-line's consistency, the interior D-line's impact, the edge rushers aside from Micah Parsons , and the cornerbacks making more plays. That sounds like a lot, but it's not too much for one offseason. Matt from Fitchburg, WI I'm not trying to be a negative nelly, but I just don't see how the O-line is going to shape up. We have two quality starters heading to free agency ( Rasheed Walker and Sean Rhyan ), and our cap space is currently in the negative. That second point opens up the possibility we have to move on from Elgton Jenkins as well. Aaron Banks is getting paid a ton and way underperformed. I know Russ Ball and Gutekunst are considered wizards, but they can't create something out of nothing. Am I missing something? The Packers have several moves they can make to create cap space. But to play out one possible, speculative scenario â there's a first-round pick in Jordan Morgan waiting in the wings to play left tackle should they decide to move on from Walker, Banks seemed to play fine as long as he was healthy, Rhyan could be a relatively inexpensive re-signing to play center, Anthony Belton appeared to find a home late in the year at right guard, and Zach Tom needs to get healthy at right tackle. There are other ways this could go, too. As I said the other day, I'm confident they can put together a solid starting five. The questions arise related to the depth after that. Jason from Boyle, MS How much is it going to cost for another team to grab Malik Willis ? Salary cap sites estimate Willis will land a contract in the $10M per year range, which this year, depending on playing time, was worth either a fifth- or sixth-round compensatory pick. Jay from Benton, AR Just wondering if the NFL has ever had a Super Bowl featuring two teams that are farther apart than the Patriots and the Seahawks? Not quite. According to sportmapworld.com, the air distance between the Patriots and Seahawks (I think the site goes by stadium location) is 2,487 miles. Back in Super Bowl XIX, the distance between the Dolphins and 49ers was 2,723 miles. The 24-hour giving day event, set for noon on Feb. 25 until noon on Feb. 26, encourages everyone to learn about and support 50 participating nonprofits to generate community-wide impact. Tom from Yardley, PA Looking at the starting quarterbacks throughout Super Bowl history the vast majority have included at least one bona fide star. This matchup clearly bucks that trend. Who do you pick to shine? Bucks that trend? Maye and Darnold may not be household names just yet, but they are stars in this league. Maye is likely to finish second in the MVP voting, and Darnold has thrown 60 TD passes over the last two seasons. Jeremiah from Middleton, WI Given that Jordan Love was sitting approximately third in MVP odds around the time that Pro Bowl votes are finalized, I was surprised that he was left out of the top three NFC QBs. I'm even more surprised that after people have dropped out and gotten replaced for the Pro Bowl, he apparently didn't make top five either. What are your thoughts? It's disappointing, but it's not as though the NFC's original three selections (Stafford, Darnold, Prescott) and first two alternates (Goff, Hurts) were slouches. Doesn't seem worth anybody's outrage. Needing to replace Maye and Josh Allen, the AFC had to dig pretty deep into its alternates, tapping Joe Flacco and Shedeur Sanders, and apparently asking Justin Fields as well, with Joe Burrow and Bo Nix unavailable. Jim from Eau Claire, WI Do you guys see any of the Packers' current free agents that they might use the franchise tag on? I don't. John from Canada I know the playoff mantra is \"just get in\" but the regular-season records mattered this year. All division weekend teams had a regular-season record of at least 12-5, except for the Bears (11-6) because they beat the Packers (9-7-1). All championship weekend teams had a regular-season record of 14-3, except for the Rams (12-5) because they defeated the Bears. Both Super Bowl teams had 14-3 regular-season records. There were similar patterns in 2024 and 2023. Is \"just get in\" realistic or wishful? Five of the six NFC playoff games were decided by three or four points (one in OT). Three of the six in the AFC were decided by three points (one in OT). That's eight out of 12 games, two in OT, that easily could've gone the other way based on one or two plays at crunch time. Jeff from New Lisbon, WI In your response to Ron from Eleva WI you state you believe the game would have been played even at minus-40 degree wind chills. At what point do you believe player safety comes into play? I understand these are tough young men but they are human and that kind of cold can be dangerous to minor extremities. I wonder how a franchise and players' union would handle a QB or receiver with severe frostbite to fingers? Where is the line with cold? Has a game ever been rescheduled due to this? Not that I know of. In this player safety era, I'd be curious what consideration would be given if another Ice Bowl-like minus-46 wind chill were due for a game. The only game I could find in the last decade or so with a wind chill worse than minus-20 was Seattle at Minnesota in the 2015 wild-card round (minus-25), played at U of M's TCF Bank Stadium while the Vikings' new home was being built. Would the league delay the game for a day if that, or something worse, came up again? Considering we now have playoff games on Mondays, maybe. The coldest wind chill in league history was the 1981 AFC title game, San Diego at Cincinnati, at minus-59 (but the minus-9 temp didn't beat the Ice Bowl's minus-13). As an Air Coryell fan in my youth, I always wondered if the Chargers had played that game anywhere else or on any other day if Dan Fouts would've gotten to a Super Bowl. But I digress. Mark from Appleton, WI It's said that football is a young man's game. As a season-ticket holder in my 70s, I've concluded attending live football games in December and January at Lambeau is also a young man's (person's) game. Do you see any potential for future upgrades at Lambeau (other than a dome) such as heated seats, warm air blowers, or whatever to make the viewing experience more accommodating? Sorry, I think it's indoor club seats or bust, man. Happy Wednesday. HAVE A QUESTION? Insider Inbox Join Packers.com writers as they answer the fans' questions in Insider Inbox That feels like an easy answer If only it were that simple It's not a cure-all Happy for him and proud to know him Everyone wants to see how this Super Bowl story ends And the wheel in the NFL sky keeps on turning Maybe it's â¦ a little bit of all of the above The cap mandates the core philosophy A massive flaw was exposed Mike Holmgren should already be in Canton and he's not The Hall of Fame has thoroughly embarrassed itself COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "948169f7b2380fe1a61516ca0b0a5de5a3e6d6cbecbbb500112eb13755bb8767", "url": "https://www.packers.com/news/green-bay-packers-foundation-seeking-grant-applicants-feb-3-2026", "body": "As the Green Bay Packers Foundation seeks to continue enhancing its charitable impact, the Foundation has announced it is launching a new four-year cycle for its annual grant program , with applications for 2026 annual grants open now until April 1. The Packers Foundation's annual grant program awards grants each year to hundreds of nonprofits in Wisconsin that support critical programs in their community and serve those in need. Last year, $1.5 million was donated to 395 civic and charitable groups in Wisconsin during the annual distribution of grants. Previously, Packers Foundation grant applications opened in the spring and grants were awarded in late fall, with each year of the three-year cycle focusing on a different need area. But as nonprofits face growing demands, the Foundation has seen increasing numbers of grant applications each year. To ensure the Foundation is providing ample support to the community and allow for the volunteer Packers Foundation Trustees to properly evaluate each grant application, the Foundation is now shifting to a four-year grant cycle (2026 â 2029) , with the application submission period from February to April. This year, the Foundation will award grants to organizations that will use the funds for programs or projects that address animal welfare, homelessness and human services . The Foundation will accept only one grant application from an eligible organization during each four-year cycle. Applicants should apply during the year in which the focus area best matches their funding needs. Only organizations whose programs fit the established criteria may apply for and be considered for grants. Grant amounts can range from $3,000 to $8,000 and recipients may not receive the total amount requested. Grant distributions vary annually based on number of applications and total amount of funding approved for distribution. All grant applications received will be reviewed by the Green Bay Packers Foundation Trustees, who will finalize the list of grant recipients in July. A public announcement of the grant recipients will take place in August or September. Organizations that are classified as exempt from Federal income tax under section 501(c)(3) of the IRS code with a valid IRS Tax ID for a minimum of two years and are located in the state of Wisconsin are eligible to apply for a grant. For more info about eligibility and the focus areas in future years of the new grant cycle, please visit packers.com/community/packers-foundation . Since it was established in 1986, the Foundation has distributed more than $29.55 million for charitable purposes. The Green Bay Packers Foundation annual grant program is part of Green Bay Packers Give Back , the Packers' all-encompassing community outreach initiative. Packers Give Back includes the Foundation's annual and impact grants, appearances by players, alumni, coaches and staff, cash and in-kind donations, community events, Make-A-Wish visits, football outreach and much more. These efforts contribute to a comprehensive Packers charity impact that was in excess of $13 million last year. Completed waivers required to participate; attendees invited to bring hygiene items to donate to the Help for the Homeless Hygiene Drive Award funded through the NFL Foundation to honor law enforcement officers Grant to help lower registration fees or provide scholarships for players in need Food and beverage crawl to feature live entertainment, winter activities, photo ops and exciting prizes Whelan to connect with Packers fans and local sports communities as team continues to grow its presence in Ireland and the UK Free to the public, event will feature story time with Cameron Moreland, a reading by a Packers celebrity and a reading in Spanish Head Coach Matt LaFleur made the announcement Monday GM Brian Gutekunst, Head Coach Matt LaFleur and Executive VP/Director of Football Operations Russ Ball signed to multi-year contract extensions Presented by U.S. Venture, Titletown Winter Games will offer luge, curling, ski jumping, biathlon and figure skating Nixon earns first career selection, replaces Seattle Seahawks CB Devon Witherspoon Green Bay signs DL Jaden Crumedy, QB Kyle McCord to reserve/future contracts COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "247ebb6a5d713a142d2fd16c13283ad22f7c626e2e47e57d6b0b5da8f6124949", "url": "https://www.packers.com/news/jordan-love-pays-it-forward-with-cleats-for-10ve-campaign-feb-3-2026", "body": "packers.com senior writer GREEN BAY â In three years as the Packers' starting quarterback, Jordan Love has continuously found ways to make a significant impact both on and off the field. More recently, the teamâs nominee for the Walter Payton NFL Man of the Year award donated nearly 2,000 pairs of cleats to youth sports teams in Wisconsin and California through his second annual \"10ve for Cleats\" campaign. For every touchdown he scored in 2025, Love pledged to donate new cleats to a youth sports team in Wisconsin and to one in his hometown of Bakersfield, Calif. With his 23 passing touchdowns during the regular season, Love and the Hands of 10ve Foundation selected 46 teams from more than 200 applications to receive new cleats. \"Watching this campaign grow â and bringing it to Bakersfield, my hometown â has been incredibly special,\" said Love. \"It's about reaching more kids and helping them just focus on the game.\" Those in Wisconsin included Columbus Catholic Schools Softball, Edison Middle School Football, Ozaukee/Random Lake Girls Soccer, Shawano Community High School Football, Gillett High School Softball/Baseball, Coleman High School Football, Green Bay West High School Boys Soccer, Loyal/Greenwood High School Football, Appleton West High School Softball, Peshtigo Middle/High School Football, Edgar Middle/High School Football, Niagara High School Baseball, Oconto Falls Football, Freedom High School Football, Appleton North Girls Flag Football, Water Cities Soccer Club, James Madison High School Football, Boscobel High School Football, New Holstein High School Football, Badger Youth Football, Webster Middle School Football. Milwaukee Public Schools Football and Green Bay Southwest High School Football. Recipients in Bakersfield included Far West Freedom Football, Bakersfield Black Gold Baseball, Golden Empire Youth Football, Northeast Knights Football, KC Hit Squad Flag Football, Bakersfield High School Girls Soccer, Foothill High School Football, East Bakersfield High School Football, Del Oro Rays Football, South High School Football, West High School Football, GEYF Pride Football, All Out Sports Football, Golden Valley High School Football, Northern Rockets Football, Western Trojans Football, All Out Pee Wee Cowboys Football, Far East Titans Football, KC Heat Baseball, Sierra Middle School Football, Liberty High School Football, Lakeside School Flag Football and Kern High School Softball. Last year, Love and his foundation donated more 1,300 cleats to 26 Wisconsin sports teams. This year, Love's foundation received 169 applications from teams in Bakersfield as well as teams from 74 different cities across the state of Wisconsin. In December, Love was named one of 32 club winners for the Walter Payton NFL Man of the Year, which recognizes players who excel on the field and demonstrate a commitment to creating a positive impact beyond the game. A national winner for the league's most prestigious award will be announced during NFL Honors Thursday night. \"That's always a part of being an NFL player,\" said Love of his selection. \"It's something I've learned and something I was able to see at a young age and have people be my role models and people I looked up to. All that kind of plays a part into it. It's fun to be able to give back and be able to impact people's lives.\" Jordan Love didn't require surgery, Zach Tom's knee injury shouldn't affect his 2026 availability He was first Green Bay punter to lead NFL in gross average since 1970 QB Jordan Love has yet to play at Lambeau Field in postseason Packers defensive lineman rehabbing from season-ending ankle injury Bethune-Cookman product was member of Green Bay's Super Bowl XLV championship team Jayden Reed, Christian Watson discuss two plays that got away Packers right tackle leaning towards surgery on partially torn patellar tendon Third-year pro had potentially historic season interrupted by knee injury All-Pro pass rusher rehabbing from torn ACL, eyeing September return Team resolved to make playoff disappointment count for something in the future Packers head coach addressed the media Sunday afternoon COPYRIGHT © GREEN BAY PACKERS, INC."}
{"id": "87339d878f54e30f1676a2bdecb147d671f96b195ce08f41a51ea7f78377db78", "url": "https://www.packers.com/news/inbox-all-sorts-of-playmakers-are-lurking-on-this-defense-feb-3-2026", "body": "packers.com senior writer Jim from Hudsonville, MI I thought the most interesting \"thing\" of Jonathan Gannonâs â5 thingsâ was the fact he was in personnel for three years. It seems to me that it would be a highly beneficial path for any coach to take at some point early in their career. The ability to identify certain talents and traits could go a long way in developing players. Adds another tool in the coach's toolbox, at least. The guy paid his dues both as a quality control coach and scout, and I feel like that combination helped propel Gannon up the coaching ranks once he caught his break with Indianapolis in 2018. Like Hafley, Gannon brings a creative scheme and past head-coaching experience to Green Bay. The other advantage is that Gannon inherits a unit with wind in its sails. All sorts of playmakers are lurking on this defense beyond just Micah Parsons and Xavier McKinney . Jeff from New Richmond, WI Mock drafts seem pointless now and are no fun without GB having a first-round pick. I would have loved to see Jim Leonhard be our DC but hard to complain about the Gannon hire. It's pretty impressive what he did after replacing Jim Schwartz in Philly with Schwartz being considered one of the top five DC in the league. Gannon had massive shoes to fill in Philly and quickly made that defense his own, experience that's undoubtedly prepared him for the situation here in Green Bay. Nathan from Laramie, WY Greetings! Thank you for the \"5 things\" on our new defensive coordinator Jonathan Gannon. I am curious what the players he has coached, and the people he has worked with, say about him. While I will miss greatly Jeff Hafley's unique enthusiasm in the press conferences, I simply request Mr. Gannon be his own, authentic self. Thank you! They're distinctly different people, but I've heard nothing but good things about Gannon from people whose opinion I trust in the NFL. He strikes me as a down-to-earth guy who's a football coach first and foremost. It also speaks volumes how Kyler Murray and others spoke about Gannon after his departure from Arizona. There also were some rumblings out of Philly this week that the Eagles were reportedly interested in a reunion if Vic Fangio retired. Tom from Cambrdige, MA I hadn't realized there were so many former HCs working as coordinators and former coordinators working as positions coaches, etc. I know even the Boston radio guys have figured out that, for example, Josh McDaniels is a great OC who will never have another HC offer. What do you attribute this \"downward\" mobility to? Has the demanding, results-oriented nature of the NFL shown us the answer to the Peter Principle? (If I was younger, this would be my B-School PhD thesis.) I think a big part of it is the meteoric rise of young coaches up the ladder. While every team is searching for the next Sean McVay, the reality is there are still 272 games each regular season. Half will be won and half will be lost. It doesn't always work out with the immense pressure on coaches hired today to win yesterday. I believe that's led to more former NFL head coaches filling coordinator seats (e.g. McDaniels, Raheem Morris, Vance Joseph, Mike McDaniel, Dennis Allen, etc.). Markus from Aurora, CO I always wonder how to kill time between the exit from the playoffs until NFL football starts again in earnest, besides just living life and working. Any advice? Enjoy each phase of the offseason calendar as it comes. The NFL has done a masterful job of making this a 12-month league, building intrigue and interest until the next ball is meaningfully snapped in September. Ron from Eleva, WI Hypothetical question. If Green Bay had a first-round bye and homefield advantage throughout playoffs, would they have played in minus-45 degree temperatures? Thank you for all your great work. I've asked myself that same question two weeks ago when it was as cold as I can remember in a Green Bay January. The game probably would have been played regardless, but it would've been in the same area code as the Ice Bowl. Paul from Ledgeview, WI Wes, what constitutes a \"rebuild\" in the NFL? We will have the same QB1 and HC, but the defensive staff will be different, the free agent/salary cap picture is complex, and the Packers have less draft capital than I would like. Does this qualify as a reset, restart, reshuffle? How do you see the transition impacting the 2026 team? Not at all. I think the Packers are doing the opposite, revving up with a young roster growing into veteran status. To me, rebuilds happen when an organization tears a team down to the floorboards and reconstructs it brick by brick. Community members participated in winter sports such as luge, curling, ski jumping, biathlon and figure skating during the seventh annual Titletown Winter Games, presented by U.S. Venture. Andrew from Cedarburg, WI I see a lot of questions about injuries and luck. Curt Cignetti said one of his main things is he wants his players fresh. They only practice 1-1Â½ hours. I notice the Packers not only had injury problems but also came out flat almost every game. Do you think it has something to do with the practice schedule or in-season strength and conditioning? Yes, injuries are part of the game, but it feels like the Packers could do more to prevent them when compared to other teams. LaFleur was actually in front of this trend when he was hired in 2019. He drastically cut down on practice time compared to the Mike McCarthy era, with training camp practices hovering in that 90-minute range in the early years. LaFleur said after the season he plans to dive into the sports science and I'm sure those findings will be a major topic at the NFL Annual Meetings at the end of March. Jeff from Littlefork, MN Oh man! Why did Arizona have to be on our schedule last year? When is the next time we are scheduled to play the Cardinals? Fans want a LaFleur Bowl, give the people what they need! (Congrats Mike a.k.a. The OTHER Coach LaFleur!) Knowing the LaFleur Bros.' relationship, I'm sure Matt is ecstatic. The LaFleurs are just the fourth pair of brothers who've become NFL head coaches, joining Jim and John Harbaugh, Jon and Jay Gruden and Al and Ted Nesser. As Mike said Monday morning, the Packers and Cards will play again in 2027. Mike from Canada The Dallas Cowboys submitted a video log of \"no-hold\" calls by refs against opponents clearly holding Micah Parsons. This season certainly yielded an abundance of such no-hold calls against Parsons on his new team. Do you see any benefit in the Packers producing and submitting to the NFL head office a similar videographic complaint? Or would this just be quixotic? GPG! Excellent use of quixotic. I'd say it's worth it. If for no other reason than getting a better explanation of what officials are seeing on those plays and what needs to happen for the laundry to be thrown. Michael from Jacksonville, FL Hi Insiders! I want to see more of the halfback pass. Why aren't they used on outside handoffs that don't get back to the line? The defense would be caught off guard. Could they just throw it away and get back to the line of scrimmage? Imagine the possibilities! Most receivers are too busy blocking to be looking for the football, though. To the idea of plays coming back around, though, it'd be cool to see the Dontayvion Wicks pass back in the game plan next season. It was fun, creative and the Packers were excellent at running it. Bill from Louisburg, KS Calling it now...I note the Saints play in Paris next year. Guess who the Packers are playing on the road in 2026? My batting average for predicting international games is extremely low, so I'm going to sit out of prophesying this year. However, Green Bay is indeed one of the Saints' nine home opponents in 2026. Doug from Salem, OR I would like to weigh in on the 18-game schedule. Eliminating preseason games does not seem like it will help with the health of players. First team (and others) play a series or two (if at all). How can eliminating a game you don't play in help you avoid wear and tear on your body when you add an additional game? I have to be missing something. Trading out a preseason game for an 18th regular-season game won't get the ball across the goal line. It's gonna take more than just that. But let's say it does happen, that's just one more hurdle for the league's best players and teams to cross during a grueling NFL season. That likely means more Jarrett Stidhams starting consequential title games. Jeffrey from Eveleth, MN I used to think that a rising salary cap favors nobody. It just makes all the players more expensive for all the teams. But maybe it does help teams to be able to pay these backloaded contracts instead of having \"cap casualties,\" no? I don't have much to say on this other than Russ Ball has been Nostradamus when it comes to gauging where the cap is headed and planning the Packers' books accordingly. Jeff from Athens, WI In regards to roster and salary cap management â when can teams make transactions using the post-June 1 designation? Based on information from another site, it looks like the Packers could free up some significant cap space by either releasing or restructuring a few players, opening the door to possible free agent or trade options to improve the roster for next season. Teams may cut up to two veterans with a post-June 1 designation as soon as the new league year begins in March. It is a rob Peter to pay Paul proposition, though. You're just kicking the can down the road, which is why the Packers took on Jaire Alexander's full cap hit in 2025. Barry from De Pere, WI Packers Everywhere. Besides fans, it seems now to cover former GB coaches on so many other teams. Surprised to read Joe Barry was in Miami, as well, and re-signed as Dolphins LB coach. I believe it was a brilliant move on Hafley's part, especially with a first-time defensive coordinator in Sean Duggan who's only 32 years old. For everything that went haywire for the Dolphins, Barry's linebackers held up their end of the bargain last season. Under Barry's watch, Jordyn Brooks went from a solid linebacker in Seattle to a first-team All-Pro in Miami. Jim from Westland, MI The Pats' defense looked great against the Saints, Titans, Browns, Falcons, Jets twice, Bengals, Ravens and Dolphins...Giants. Battle-tested? I know it's not their fault they played a last-place schedule, however, call me skeptical and predict a 'Hawks rout. I say that because their offense squared off against the Saints, Titans... I'm favoring Seattle. The Pats are a great story, but the Seahawks probably faced stiffer competition within their own division than New England did all season. Credit to the Patriots. They've beaten all but one team put in front of them over the past four months, but Seattle is the Pats' biggest test by far. Mike from Baraboo, WI What will Seattle need to do to win and what will the Patriots need to do to win? Ball security. New England has to get Sam Darnold to turn over the ball a couple, three times and Drake Maye must keep the chains moving to prevail. The Seahawks are the NFL's most efficient squad and they will papercut you to death if you let them. Ray from Phoenix, AZ Do the Packers still have the ability to trade any of their upcoming FA players before those players are free to talk to other teams about signing a contract? No. They'd have to franchise tag them to retain their rights in order to trade them (e.g. Davante Adams in March 2022). Bob from Rome, NY Wes: I am somewhere between Mike and you on MLB. I didn't watch from after the 1994 strike (eighth strike in 20 years) for about 20 years. I waited until almost all the players involved in the strike were done. It also coincided with a high school classmate of mine becoming commissioner. What are your thoughts on the impacts of a possible 2027 strike on the fan base? Do you think another World Series cancellation is a possibility? Awaiting your expertise opinion. Thank you! A strike would be devastating for Major League Baseball, but it also may be necessary for the league to grow. I respect Mike's approach to his Brewers fandom. It's commendable and principled. As a casual fan, I need an even playing field to be fully invested. Call me a killjoy, but I can't overlook the Dodgers having a salary three times that of the Brewers. Justin from De Pere, WI What's your favorite part of the offseason? This is honestly one of them. I'd love to be covering a Super Bowl right now, but it's nice to relax and catch your breath again after a six-month gauntlet. Justin from Thousand Oaks, CA In coach interviews, I've always wondered: Do candidates bring visual aids? Seems like if you're explaining an offensive or defensive approach, it might help to have a presentation or cutups or some other way to break it down, but maybe in the culture it would be frowned upon and they'd rather just talk. Some bring binders. Some bring PowerPoints. Everyone brings a plan. Jennifer from Middleton, WI Sooooo, Matt LaFleur's brother Mike LaFleur is getting the HC job in Arizona, formerly held by Jonathan Gannon, who is now Matt's DC in Green Bay because his former DC Jeff Hafley is now the HC of the Dolphins where he's retaining Joe Barry, who used to be Matt's DC in Green Bay. Lots of fun sentences like that to be had across the league this year. It's like everyone is using the same ingredients but mixing them up in different combinations trying to see who can make the prize-winning soup. And the wheel in the NFL sky keeps on turning. HAVE A QUESTION? Insider Inbox Join Packers.com writers as they answer the fans' questions in Insider Inbox That feels like an easy answer If only it were that simple It's not a cure-all Happy for him and proud to know him Everyone wants to see how this Super Bowl story ends It's not too much for one offseason Maybe it's â¦ a little bit of all of the above The cap mandates the core philosophy A massive flaw was exposed Mike Holmgren should already be in Canton and he's not The Hall of Fame has thoroughly embarrassed itself COPYRIGHT © GREEN BAY PACKERS, INC."}
